/* automatically generated by rust-bindgen 0.70.1 */

pub const SC_ANSI_ESCAPE_CODE_RESET: &[u8; 5] = b"\x1B[0m\0";
pub const SC_ANSI_ESCAPE_CODE_BOLD: &[u8; 5] = b"\x1B[1m\0";
pub const SC_ANSI_ESCAPE_CODE_DIM: &[u8; 5] = b"\x1B[2m\0";
pub const SC_ANSI_ESCAPE_CODE_ITALIC: &[u8; 5] = b"\x1B[3m\0";
pub const SC_ANSI_ESCAPE_CODE_UNDERLINE: &[u8; 5] = b"\x1B[4m\0";
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __darwin_off_t = __int64_t;
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::std::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::std::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::std::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::std::mem::offset_of!(__sbuf, _size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::std::mem::size_of::<__sFILE>() - 152usize];
    ["Alignment of __sFILE"][::std::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::std::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::std::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::std::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::std::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::std::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::std::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::std::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_cookie"][::std::mem::offset_of!(__sFILE, _cookie) - 48usize];
    ["Offset of field: __sFILE::_close"][::std::mem::offset_of!(__sFILE, _close) - 56usize];
    ["Offset of field: __sFILE::_read"][::std::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_seek"][::std::mem::offset_of!(__sFILE, _seek) - 72usize];
    ["Offset of field: __sFILE::_write"][::std::mem::offset_of!(__sFILE, _write) - 80usize];
    ["Offset of field: __sFILE::_ub"][::std::mem::offset_of!(__sFILE, _ub) - 88usize];
    ["Offset of field: __sFILE::_extra"][::std::mem::offset_of!(__sFILE, _extra) - 104usize];
    ["Offset of field: __sFILE::_ur"][::std::mem::offset_of!(__sFILE, _ur) - 112usize];
    ["Offset of field: __sFILE::_ubuf"][::std::mem::offset_of!(__sFILE, _ubuf) - 116usize];
    ["Offset of field: __sFILE::_nbuf"][::std::mem::offset_of!(__sFILE, _nbuf) - 119usize];
    ["Offset of field: __sFILE::_lb"][::std::mem::offset_of!(__sFILE, _lb) - 120usize];
    ["Offset of field: __sFILE::_blksize"][::std::mem::offset_of!(__sFILE, _blksize) - 136usize];
    ["Offset of field: __sFILE::_offset"][::std::mem::offset_of!(__sFILE, _offset) - 144usize];
};
pub type FILE = __sFILE;
extern "C" {
    #[doc = " Returns the runtime library version components.\n\n Each pointer is optional and may be `NULL` if the caller is not\n interested in that component."]
    pub fn sc_version(
        major: *mut ::std::os::raw::c_int,
        minor: *mut ::std::os::raw::c_int,
        patch: *mut ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Returns a human-readable version string, e.g. `\"0.1.0\"`."]
    pub fn sc_version_string() -> *const ::std::os::raw::c_char;
}
pub const ScTextAttribute_SC_TEXT_ATTR_NONE: ScTextAttribute = 0;
pub const ScTextAttribute_SC_TEXT_ATTR_BOLD: ScTextAttribute = 1;
pub const ScTextAttribute_SC_TEXT_ATTR_DIM: ScTextAttribute = 2;
pub const ScTextAttribute_SC_TEXT_ATTR_ITALIC: ScTextAttribute = 4;
pub const ScTextAttribute_SC_TEXT_ATTR_UNDER: ScTextAttribute = 8;
#[doc = " Text attribute flags for terminal output (none, bold, etc.).\n\n Each flag occupies exactly one bit so styles can be combined with |.\n\n Example:\n @code\n SC_TEXT_ATTR_BOLD | SC_TEXT_ATTR_ITALIC  =  0b0001 | 0b0010  =  0b0011\n @endcode"]
pub type ScTextAttribute = ::std::os::raw::c_uint;
#[doc = " Namespace type for `ScTextAttribute` - groups all flags under dot notation.\n\n Copy `ScTextAttributeNs_` locally to get a short alias:\n\n @code\n ScTextAttributeNs attr = ScTextAttributeNs_;\n sc_print(\"hi\", (ScTextStyle){ attr.BOLD | attr.ITALIC, ... });\n // vs.\n sc_print(\"hi\", (ScTextStyle){\n     SC_TEXT_ATTR_BOLD | SC_TEXT_ATTR_ITALIC, ... });\n @endcode"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScTextAttributeNs {
    pub NONE: ScTextAttribute,
    pub BOLD: ScTextAttribute,
    pub DIM: ScTextAttribute,
    pub ITALIC: ScTextAttribute,
    pub UNDER: ScTextAttribute,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScTextAttributeNs"][::std::mem::size_of::<ScTextAttributeNs>() - 20usize];
    ["Alignment of ScTextAttributeNs"][::std::mem::align_of::<ScTextAttributeNs>() - 4usize];
    ["Offset of field: ScTextAttributeNs::NONE"]
        [::std::mem::offset_of!(ScTextAttributeNs, NONE) - 0usize];
    ["Offset of field: ScTextAttributeNs::BOLD"]
        [::std::mem::offset_of!(ScTextAttributeNs, BOLD) - 4usize];
    ["Offset of field: ScTextAttributeNs::DIM"]
        [::std::mem::offset_of!(ScTextAttributeNs, DIM) - 8usize];
    ["Offset of field: ScTextAttributeNs::ITALIC"]
        [::std::mem::offset_of!(ScTextAttributeNs, ITALIC) - 12usize];
    ["Offset of field: ScTextAttributeNs::UNDER"]
        [::std::mem::offset_of!(ScTextAttributeNs, UNDER) - 16usize];
};
#[doc = " Represents a terminal color, either as a named ANSI color or RGB."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScColor {
    #[doc = " `0` = not set (zero-init); `-1` = RGB mode; `1`-`8` = ANSI color."]
    pub index: ::std::os::raw::c_int,
    #[doc = " RGB values (0-255), used when `index == -1`."]
    pub r: u8,
    #[doc = " RGB values (0-255), used when `index == -1`."]
    pub g: u8,
    #[doc = " RGB values (0-255), used when `index == -1`."]
    pub b: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScColor"][::std::mem::size_of::<ScColor>() - 8usize];
    ["Alignment of ScColor"][::std::mem::align_of::<ScColor>() - 4usize];
    ["Offset of field: ScColor::index"][::std::mem::offset_of!(ScColor, index) - 0usize];
    ["Offset of field: ScColor::r"][::std::mem::offset_of!(ScColor, r) - 4usize];
    ["Offset of field: ScColor::g"][::std::mem::offset_of!(ScColor, g) - 5usize];
    ["Offset of field: ScColor::b"][::std::mem::offset_of!(ScColor, b) - 6usize];
};
#[doc = " Namespace type for `SC_ANSI_COLOR_...` - groups all predefined ANSI colors\n under dot notation.\n\n Copy `ScAnsiColorNs_` locally to get a short alias:\n @code\n ScAnsiColorNs clr = ScAnsiColorNs_;\n sc_print(\"hi\", (ScTextStyle){ ..., clr.RED, clr.NONE });\n @endcode"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScAnsiColorNs {
    pub NONE: ScColor,
    pub BLACK: ScColor,
    pub RED: ScColor,
    pub GREEN: ScColor,
    pub YELLOW: ScColor,
    pub BLUE: ScColor,
    pub MAGENTA: ScColor,
    pub CYAN: ScColor,
    pub WHITE: ScColor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScAnsiColorNs"][::std::mem::size_of::<ScAnsiColorNs>() - 72usize];
    ["Alignment of ScAnsiColorNs"][::std::mem::align_of::<ScAnsiColorNs>() - 4usize];
    ["Offset of field: ScAnsiColorNs::NONE"][::std::mem::offset_of!(ScAnsiColorNs, NONE) - 0usize];
    ["Offset of field: ScAnsiColorNs::BLACK"]
        [::std::mem::offset_of!(ScAnsiColorNs, BLACK) - 8usize];
    ["Offset of field: ScAnsiColorNs::RED"][::std::mem::offset_of!(ScAnsiColorNs, RED) - 16usize];
    ["Offset of field: ScAnsiColorNs::GREEN"]
        [::std::mem::offset_of!(ScAnsiColorNs, GREEN) - 24usize];
    ["Offset of field: ScAnsiColorNs::YELLOW"]
        [::std::mem::offset_of!(ScAnsiColorNs, YELLOW) - 32usize];
    ["Offset of field: ScAnsiColorNs::BLUE"][::std::mem::offset_of!(ScAnsiColorNs, BLUE) - 40usize];
    ["Offset of field: ScAnsiColorNs::MAGENTA"]
        [::std::mem::offset_of!(ScAnsiColorNs, MAGENTA) - 48usize];
    ["Offset of field: ScAnsiColorNs::CYAN"][::std::mem::offset_of!(ScAnsiColorNs, CYAN) - 56usize];
    ["Offset of field: ScAnsiColorNs::WHITE"]
        [::std::mem::offset_of!(ScAnsiColorNs, WHITE) - 64usize];
};
#[doc = " Combines text attributes and colors for terminal output."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScTextStyle {
    #[doc = " Text attribute flags (bold, italic, …)."]
    pub attr: ScTextAttribute,
    #[doc = " Foreground color (ANSI index or RGB)."]
    pub fg: ScColor,
    #[doc = " Background color (ANSI index or RGB)."]
    pub bg: ScColor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScTextStyle"][::std::mem::size_of::<ScTextStyle>() - 20usize];
    ["Alignment of ScTextStyle"][::std::mem::align_of::<ScTextStyle>() - 4usize];
    ["Offset of field: ScTextStyle::attr"][::std::mem::offset_of!(ScTextStyle, attr) - 0usize];
    ["Offset of field: ScTextStyle::fg"][::std::mem::offset_of!(ScTextStyle, fg) - 4usize];
    ["Offset of field: ScTextStyle::bg"][::std::mem::offset_of!(ScTextStyle, bg) - 12usize];
};
pub const ScBorderType_SC_BORDER_NONE: ScBorderType = 0;
pub const ScBorderType_SC_BORDER_ASCII: ScBorderType = 1;
pub const ScBorderType_SC_BORDER_SINGLE: ScBorderType = 2;
pub const ScBorderType_SC_BORDER_DOUBLE: ScBorderType = 3;
pub const ScBorderType_SC_BORDER_ROUNDED: ScBorderType = 4;
pub const ScBorderType_SC_BORDER_THICK: ScBorderType = 5;
#[doc = " Styles for border around components (none, ASCII, single, double, etc.)."]
pub type ScBorderType = ::std::os::raw::c_uint;
pub const ScPosition_SC_POSITION_TOP: ScPosition = 0;
pub const ScPosition_SC_POSITION_BOTTOM: ScPosition = 1;
#[doc = " Position of the title in a component (top or bottom)."]
pub type ScPosition = ::std::os::raw::c_uint;
pub const ScHAlign_SC_ALIGN_LEFT: ScHAlign = 0;
pub const ScHAlign_SC_ALIGN_CENTER: ScHAlign = 1;
pub const ScHAlign_SC_ALIGN_RIGHT: ScHAlign = 2;
#[doc = " Horizontal alignment options (left, center, right) for text and components."]
pub type ScHAlign = ::std::os::raw::c_uint;
pub const ScVAlign_SC_VALIGN_TOP: ScVAlign = 0;
pub const ScVAlign_SC_VALIGN_MIDDLE: ScVAlign = 1;
pub const ScVAlign_SC_VALIGN_BOTTOM: ScVAlign = 2;
#[doc = " Vertical alignment options (top, middle, bottom) for text and components."]
pub type ScVAlign = ::std::os::raw::c_uint;
#[doc = " Represents box-model insets (top, right, bottom, left) for layout\n purposes. Zero-initialization means no inset."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScEdges {
    pub top: ::std::os::raw::c_int,
    pub right: ::std::os::raw::c_int,
    pub bottom: ::std::os::raw::c_int,
    pub left: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScEdges"][::std::mem::size_of::<ScEdges>() - 16usize];
    ["Alignment of ScEdges"][::std::mem::align_of::<ScEdges>() - 4usize];
    ["Offset of field: ScEdges::top"][::std::mem::offset_of!(ScEdges, top) - 0usize];
    ["Offset of field: ScEdges::right"][::std::mem::offset_of!(ScEdges, right) - 4usize];
    ["Offset of field: ScEdges::bottom"][::std::mem::offset_of!(ScEdges, bottom) - 8usize];
    ["Offset of field: ScEdges::left"][::std::mem::offset_of!(ScEdges, left) - 12usize];
};
#[doc = " Groups the three visual properties of a border: character style,\n foreground color, and background color."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScBorderStyle {
    #[doc = " Border character set (none, ASCII, single, …)."]
    pub type_: ScBorderType,
    #[doc = " Foreground color of border characters."]
    pub color: ScColor,
    #[doc = " Background color of border characters; zero-init = none."]
    pub bg: ScColor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScBorderStyle"][::std::mem::size_of::<ScBorderStyle>() - 20usize];
    ["Alignment of ScBorderStyle"][::std::mem::align_of::<ScBorderStyle>() - 4usize];
    ["Offset of field: ScBorderStyle::type_"]
        [::std::mem::offset_of!(ScBorderStyle, type_) - 0usize];
    ["Offset of field: ScBorderStyle::color"]
        [::std::mem::offset_of!(ScBorderStyle, color) - 4usize];
    ["Offset of field: ScBorderStyle::bg"][::std::mem::offset_of!(ScBorderStyle, bg) - 12usize];
};
#[doc = " All visual properties of a component title: text, rendering, alignment,\n padding and position. Used directly by ScRuleOpts (pos is ignored for\n rules) and by panels/tables."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScTitle {
    #[doc = " Title string; `NULL` = no title."]
    pub text: *const ::std::os::raw::c_char,
    #[doc = " Optional rich title (mixed styles). When non-`NULL` it overrides `text`\n and `style`, and its visible width is used for layout. Currently honored\n by panels (incl. boxed input prompts); rules/tables ignore it. Borrowed -\n must outlive the render call."]
    pub rich_text: *mut ScText,
    #[doc = " Text style (bold, color, …) applied to the title."]
    pub style: ScTextStyle,
    #[doc = " Horizontal placement of the title."]
    pub halign: ScHAlign,
    #[doc = " Spaces on each side of the title text."]
    pub pad: ::std::os::raw::c_int,
    #[doc = " `SC_POSITION_TOP` / `SC_POSITION_BOTTOM`; unused for rules."]
    pub pos: ScPosition,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScTitle"][::std::mem::size_of::<ScTitle>() - 48usize];
    ["Alignment of ScTitle"][::std::mem::align_of::<ScTitle>() - 8usize];
    ["Offset of field: ScTitle::text"][::std::mem::offset_of!(ScTitle, text) - 0usize];
    ["Offset of field: ScTitle::rich_text"][::std::mem::offset_of!(ScTitle, rich_text) - 8usize];
    ["Offset of field: ScTitle::style"][::std::mem::offset_of!(ScTitle, style) - 16usize];
    ["Offset of field: ScTitle::halign"][::std::mem::offset_of!(ScTitle, halign) - 36usize];
    ["Offset of field: ScTitle::pad"][::std::mem::offset_of!(ScTitle, pad) - 40usize];
    ["Offset of field: ScTitle::pos"][::std::mem::offset_of!(ScTitle, pos) - 44usize];
};
#[doc = " Inherit the global `sc_set_allow_ansi` setting (the default)."]
pub const ScAnsiMode_SC_ANSI_MODE_DEFAULT: ScAnsiMode = 0;
#[doc = " Pass well-formed ANSI escape sequences (CSI/OSC/DCS/…) through.\n Stray control bytes are still removed; widths are computed\n ANSI-aware so frames stay aligned."]
pub const ScAnsiMode_SC_ANSI_MODE_ALLOW: ScAnsiMode = 1;
#[doc = " Always strip escape sequences, regardless of the global setting."]
pub const ScAnsiMode_SC_ANSI_MODE_SANITIZE: ScAnsiMode = 2;
#[doc = " Per-widget ANSI passthrough mode for user-supplied strings.\n\n By default every string entering the library is sanitized: control\n bytes (except `\\n` and `\\t`) and ANSI escape sequences are removed so\n untrusted data cannot inject terminal escape codes. The zero-init\n value inherits the process-wide setting (`sc_set_allow_ansi`); the\n other values override it for one widget."]
pub type ScAnsiMode = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Sets the process-wide default for ANSI passthrough in user strings.\n\n When `false` (the default), every string handed to the library has\n ANSI escape sequences and control bytes (except `\\n`, `\\t`) stripped\n at the API boundary - untrusted data cannot inject escape codes.\n When `true`, well-formed escape sequences are preserved (stray\n control bytes are still removed) and all width calculations skip\n them, so borders and frames stay aligned.\n\n Per-widget opts can override this via their `ScAnsiMode ansi` field.\n Thread-safe; intended as set-once configuration at startup.\n\n @param allow  `true` = pass ANSI sequences through; `false` = strip."]
    pub fn sc_set_allow_ansi(allow: bool);
}
extern "C" {
    #[doc = " Returns the current process-wide ANSI passthrough setting.\n\n @return  `true` when ANSI escape sequences are passed through."]
    pub fn sc_allow_ansi() -> bool;
}
extern "C" {
    #[doc = " Creates an `ScColor` from 24-bit RGB values.\n\n The returned color has `index = -1`, which selects RGB mode when passed to\n any function that accepts @ref ScColor.\n\n @param r  Red channel (0-255).\n @param g  Green channel (0-255).\n @param b  Blue channel (0-255).\n @return   An `ScColor` with `index = -1` and the given RGB values."]
    pub fn sc_color_from_rgb(r: u8, g: u8, b: u8) -> ScColor;
}
extern "C" {
    #[doc = " These eight functions return the predefined ANSI color constants as\n regular function calls. Use them from bindings that cannot consume\n the `SC_ANSI_COLOR_*` compound-literal macros (Python via ctypes/cffi,\n Rust via bindgen for the macro values, etc.).\n\n The C-side macros remain available for native callers; they are\n equivalent."]
    pub fn sc_color_none() -> ScColor;
}
extern "C" {
    pub fn sc_color_black() -> ScColor;
}
extern "C" {
    pub fn sc_color_red() -> ScColor;
}
extern "C" {
    pub fn sc_color_green() -> ScColor;
}
extern "C" {
    pub fn sc_color_yellow() -> ScColor;
}
extern "C" {
    pub fn sc_color_blue() -> ScColor;
}
extern "C" {
    pub fn sc_color_magenta() -> ScColor;
}
extern "C" {
    pub fn sc_color_cyan() -> ScColor;
}
extern "C" {
    pub fn sc_color_white() -> ScColor;
}
extern "C" {
    #[doc = " Builds an `ScTextStyle` from its three components.\n\n Equivalent to the C99 compound literal\n `(ScTextStyle){ attr, fg, bg }`, but usable from bindings that cannot\n construct compound literals."]
    pub fn sc_text_style(attr: ScTextAttribute, fg: ScColor, bg: ScColor) -> ScTextStyle;
}
extern "C" {
    #[doc = " Prints `text` to stdout with ANSI styling applied.\n\n Applies the attribute flags and foreground/background colors from `opts`\n before the text, then always emits a reset escape (`\\\\033[0m`) afterwards\n to prevent styling from leaking into subsequent output.\n\n @param raw_str  Null-terminated string to print. Must not be `NULL`.\n @param style    Style and color options. Use `SC_TEXT_ATTR_NONE` to emit no\n                 attribute codes. Use `SC_ANSI_COLOR_NONE` for fg/bg to emit\n                 no color codes.\n\n @note The reset is always emitted, even when `opts` doesn't carry\n any formatting.\n\n @code\n sc_print(\"Error\", (ScTextStyle){\n     SC_TEXT_ATTR_BOLD, SC_ANSI_COLOR_RED, SC_ANSI_COLOR_NONE\n });\n @endcode"]
    pub fn sc_print(raw_str: *const ::std::os::raw::c_char, style: ScTextStyle);
}
extern "C" {
    #[doc = " Prints text to stdout with ANSI styling applied, followed by a newline.\n\n Equivalent to `sc_print` followed by `\\\\n`.\n\n @param raw_str  Null-terminated string to print. Must not be `NULL`.\n @param style    Style and color options. See @ref sc_print for details."]
    pub fn sc_println(raw_str: *const ::std::os::raw::c_char, style: ScTextStyle);
}
#[doc = " A single styled run of text within an ScText.\n\n `raw_str` holds the raw UTF-8 bytes (no ANSI codes); the style is\n applied at render time. A span may contain newlines to produce\n multi-line output."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScSpan {
    #[doc = " Heap-allocated UTF-8 string, no ANSI codes."]
    pub raw_str: *mut ::std::os::raw::c_char,
    #[doc = " Style applied at render time."]
    pub style: ScTextStyle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScSpan"][::std::mem::size_of::<ScSpan>() - 32usize];
    ["Alignment of ScSpan"][::std::mem::align_of::<ScSpan>() - 8usize];
    ["Offset of field: ScSpan::raw_str"][::std::mem::offset_of!(ScSpan, raw_str) - 0usize];
    ["Offset of field: ScSpan::style"][::std::mem::offset_of!(ScSpan, style) - 8usize];
};
extern "C" {
    #[doc = " Allocates an empty `ScText` with no spans.\n\n @return  Heap-allocated empty text; `NULL` on allocation failure.\n          Caller must free with `sc_text_free`."]
    pub fn sc_text_new() -> *mut ScText;
}
extern "C" {
    #[doc = " Allocates an `ScText` containing `str` as a single unstyled span.\n\n @param str  Source string; copied internally; caller retains ownership.\n             `NULL` is treated as an empty string.\n @return     Heap-allocated text; `NULL` on allocation failure."]
    pub fn sc_text_from_str(str_: *const ::std::os::raw::c_char) -> *mut ScText;
}
extern "C" {
    #[doc = " Appends a new span to `text` with the given UTF-8 string and style.\n\n `raw_str` is duplicated internally; the caller retains ownership.\n\n @param text     Target text; no-op when `NULL`.\n @param raw_str  UTF-8 string; no-op when `NULL`.\n @param style    Style applied to this span."]
    pub fn sc_text_append(
        text: *mut ScText,
        raw_str: *const ::std::os::raw::c_char,
        style: ScTextStyle,
    );
}
extern "C" {
    #[doc = " Frees `text` and all owned spans.\n\n @param text  Object to free; safe to pass `NULL`."]
    pub fn sc_text_free(text: *mut ScText);
}
extern "C" {
    #[doc = " Prints all spans of `text` to the current output stream.\n\n Newlines within a span's `raw_str` are passed through as-is; the style\n is applied per segment between newlines so line breaks do not carry\n ANSI codes.\n\n @param text  Text to print; no-op when `NULL`."]
    pub fn sc_print_text(text: *const ScText);
}
extern "C" {
    #[doc = " Returns the maximum visible column width across all lines of `text`.\n\n Counts UTF-8 codepoints and resets the counter at each newline.\n\n @param text  Text to measure; returns `0` when `NULL`."]
    pub fn sc_text_visible_width(text: *const ScText) -> usize;
}
extern "C" {
    #[doc = " Returns the number of spans currently in `text`.\n\n @param text  Text to inspect; returns `0` when `NULL`."]
    pub fn sc_text_span_count(text: *const ScText) -> usize;
}
extern "C" {
    #[doc = " Returns the span at `index` (by-value copy).\n\n Out-of-range `index` or a `NULL` `text` returns a zero-initialized\n `ScSpan` (`{ NULL, … }`).\n\n @param text   Text to inspect.\n @param index  Zero-based span index."]
    pub fn sc_text_span(text: *const ScText, index: usize) -> ScSpan;
}
#[doc = " Parser options that change how unrecognized tags are handled."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScMarkupOpts {
    #[doc = " When `true`, unrecognized tags (e.g. `[blink]`) are silently dropped\n and only their inner content is kept; when `false` (default), the\n tag brackets are emitted as literal text."]
    pub strip_unknown: bool,
    #[doc = " ANSI passthrough for raw escape bytes in the markup text; zero-init\n inherits the `sc_set_allow_ansi` global."]
    pub ansi: ScAnsiMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScMarkupOpts"][::std::mem::size_of::<ScMarkupOpts>() - 8usize];
    ["Alignment of ScMarkupOpts"][::std::mem::align_of::<ScMarkupOpts>() - 4usize];
    ["Offset of field: ScMarkupOpts::strip_unknown"]
        [::std::mem::offset_of!(ScMarkupOpts, strip_unknown) - 0usize];
    ["Offset of field: ScMarkupOpts::ansi"][::std::mem::offset_of!(ScMarkupOpts, ansi) - 4usize];
};
extern "C" {
    #[doc = " Parses `markup` into a new `ScText` using default options.\n\n @param markup  Source string with Rich-style tags (e.g. `[bold red]…[/]`).\n                Pass `NULL` to get an empty `ScText`.\n @return        Heap-allocated `ScText`; free with `sc_text_free`."]
    pub fn sc_markup_parse(markup: *const ::std::os::raw::c_char) -> *mut ScText;
}
extern "C" {
    #[doc = " Parses `markup` into a new `ScText` honoring `opts`.\n\n @param markup  Source string; may be `NULL`.\n @param opts    Parser options (e.g. `strip_unknown`).\n @return        Heap-allocated `ScText`; free with `sc_text_free`."]
    pub fn sc_markup_parse_opts(
        markup: *const ::std::os::raw::c_char,
        opts: ScMarkupOpts,
    ) -> *mut ScText;
}
extern "C" {
    #[doc = " Parses `markup` and appends each resulting span to `text`.\n\n @param text    Existing `ScText` to append into.\n @param markup  Source markup string."]
    pub fn sc_markup_append(text: *mut ScText, markup: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Parses `markup` honoring `opts` and appends each span to `text`.\n\n @param text    Existing `ScText` to append into.\n @param markup  Source markup string.\n @param opts    Parser options."]
    pub fn sc_markup_append_opts(
        text: *mut ScText,
        markup: *const ::std::os::raw::c_char,
        opts: ScMarkupOpts,
    );
}
extern "C" {
    #[doc = " Parses `markup` and prints the result to stdout (no trailing newline)."]
    pub fn sc_markup_print(markup: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Parses `markup` honoring `opts` and prints the result (no newline)."]
    pub fn sc_markup_print_opts(markup: *const ::std::os::raw::c_char, opts: ScMarkupOpts);
}
extern "C" {
    #[doc = " Same as `sc_markup_print` followed by `\\\\n`."]
    pub fn sc_markup_println(markup: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Same as `sc_markup_print_opts` followed by `\\\\n`."]
    pub fn sc_markup_println_opts(markup: *const ::std::os::raw::c_char, opts: ScMarkupOpts);
}
#[doc = " A captured, line-split rendering of any widget.\n\n Produced by the `sc_capture_*` family of functions. Each line retains its\n original ANSI escape codes; `column_widths` holds the corresponding visible\n column count so callers never need to re-parse escape sequences for\n layout arithmetic.\n\n Pass to `sc_pad_print()`, `sc_align_print()` or `sc_columns_add_rendered()`.\n Free with `sc_rendered_free()`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScRendered {
    #[doc = " Heap-allocated strings, ANSI codes included."]
    pub lines: *mut *mut ::std::os::raw::c_char,
    #[doc = " Visible column width per line, parallel to lines."]
    pub column_widths: *mut ::std::os::raw::c_int,
    #[doc = " Number of lines."]
    pub line_count: usize,
    #[doc = " Maximum visible width across all lines."]
    pub max_column_width: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScRendered"][::std::mem::size_of::<ScRendered>() - 32usize];
    ["Alignment of ScRendered"][::std::mem::align_of::<ScRendered>() - 8usize];
    ["Offset of field: ScRendered::lines"][::std::mem::offset_of!(ScRendered, lines) - 0usize];
    ["Offset of field: ScRendered::column_widths"]
        [::std::mem::offset_of!(ScRendered, column_widths) - 8usize];
    ["Offset of field: ScRendered::line_count"]
        [::std::mem::offset_of!(ScRendered, line_count) - 16usize];
    ["Offset of field: ScRendered::max_column_width"]
        [::std::mem::offset_of!(ScRendered, max_column_width) - 24usize];
};
extern "C" {
    pub fn sc_rendered_free(r: *mut ScRendered);
}
#[doc = " Layout and visual options for a bordered content panel.\n\n Zero-initialize to get sensible defaults: no border, no background, no title,\n auto width, no padding, and no margin.\n\n @note `full_width` overrides `width` when both are set; the panel width is\n then `terminal_width - 2` (one column margin each side).\n\n @note `bg` uses the same zero-init sentinel as\n `ScProgressBarOpts.fill_color`: `{0,0,0,0}` (index==0 AND r==g==b==0\n together) means \"not set\".\n\n @code\n ScPanelOpts opts = {\n     .border  = { SC_BORDER_ROUNDED, SC_ANSI_COLOR_CYAN, SC_ANSI_COLOR_NONE },\n     .title   = {\n         .text = \"Status\", .halign = SC_ALIGN_CENTER, .pad = 1,\n         .pos  = SC_POSITION_TOP\n     },\n     .padding = { .top = 1, .right = 2, .bottom = 1, .left = 2 },\n     .full_width    = true,\n     .content_align = SC_ALIGN_LEFT,\n };\n sc_panel_str(\"All systems operational.\", opts);\n @endcode"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScPanelOpts {
    #[doc = " Border type, foreground and background color."]
    pub border: ScBorderStyle,
    #[doc = " Content area background; zero-init (`{0,0,0,0}`) = no color."]
    pub bg: ScColor,
    #[doc = " Title bar: text, style, alignment, padding and position."]
    pub title: ScTitle,
    #[doc = " Optional second title on the edge selected by its own `pos`; zero-init\n (`text == NULL`) = none. Use it for the opposite edge from `title`, e.g.\n a top title plus a bottom-right caption."]
    pub subtitle: ScTitle,
    #[doc = " When `true`, stretches to terminal width (overrides `width`); computed\n as `terminal_width - 2`."]
    pub full_width: bool,
    #[doc = " Panel width; `0` = auto-fit to content."]
    pub width: ::std::os::raw::c_int,
    #[doc = " Horizontal alignment of content lines."]
    pub content_align: ScHAlign,
    #[doc = " Inner spacing (top/right/bottom/left)."]
    pub padding: ScEdges,
    #[doc = " Outer spacing (top/right/bottom/left)."]
    pub margin: ScEdges,
    #[doc = " ANSI passthrough for content and title strings; zero-init inherits\n the `sc_set_allow_ansi` global."]
    pub ansi: ScAnsiMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScPanelOpts"][::std::mem::size_of::<ScPanelOpts>() - 176usize];
    ["Alignment of ScPanelOpts"][::std::mem::align_of::<ScPanelOpts>() - 8usize];
    ["Offset of field: ScPanelOpts::border"][::std::mem::offset_of!(ScPanelOpts, border) - 0usize];
    ["Offset of field: ScPanelOpts::bg"][::std::mem::offset_of!(ScPanelOpts, bg) - 20usize];
    ["Offset of field: ScPanelOpts::title"][::std::mem::offset_of!(ScPanelOpts, title) - 32usize];
    ["Offset of field: ScPanelOpts::subtitle"]
        [::std::mem::offset_of!(ScPanelOpts, subtitle) - 80usize];
    ["Offset of field: ScPanelOpts::full_width"]
        [::std::mem::offset_of!(ScPanelOpts, full_width) - 128usize];
    ["Offset of field: ScPanelOpts::width"][::std::mem::offset_of!(ScPanelOpts, width) - 132usize];
    ["Offset of field: ScPanelOpts::content_align"]
        [::std::mem::offset_of!(ScPanelOpts, content_align) - 136usize];
    ["Offset of field: ScPanelOpts::padding"]
        [::std::mem::offset_of!(ScPanelOpts, padding) - 140usize];
    ["Offset of field: ScPanelOpts::margin"]
        [::std::mem::offset_of!(ScPanelOpts, margin) - 156usize];
    ["Offset of field: ScPanelOpts::ansi"][::std::mem::offset_of!(ScPanelOpts, ansi) - 172usize];
};
extern "C" {
    #[doc = " Renders a null-terminated string inside a styled, bordered panel.\n\n The string may contain `\\n` to produce multi-line content. Each line is\n aligned according to `opts.content_align` and padded by `opts.padding`.\n\n @param content  Null-terminated string to display inside the panel.\n                 Must not be `NULL`.\n @param opts     Layout and visual options; see `ScPanelOpts`."]
    pub fn sc_panel_str(content: *const ::std::os::raw::c_char, opts: ScPanelOpts);
}
extern "C" {
    #[doc = " Renders a multi-span `ScText` object inside a styled, bordered panel.\n\n Use this variant when the content requires mixed styling (colors, bold, etc.)\n across different text spans. Each line of the `ScText` is aligned and padded\n according to the opts.\n\n @param content  Rich-text content to display. Must not be `NULL`.\n @param opts     Layout and visual options; see `ScPanelOpts`."]
    pub fn sc_panel_text(content: *const ScText, opts: ScPanelOpts);
}
pub const ScCellKind_SC_CELL_STR: ScCellKind = 0;
pub const ScCellKind_SC_CELL_TEXT: ScCellKind = 1;
pub const ScCellKind_SC_CELL_MARKUP: ScCellKind = 2;
#[doc = " Discriminator tag for `ScCell.kind`:\n determines which content field is active."]
pub type ScCellKind = ::std::os::raw::c_uint;
#[doc = " One cell in a table row."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScCell {
    #[doc = " Content type; determines which of `str` or `text` is active."]
    pub kind: ScCellKind,
    #[doc = " Plain string content; not owned; active when `kind == SC_CELL_STR`."]
    pub str_: *const ::std::os::raw::c_char,
    #[doc = " Rich-text content; `SC_CELL_TEXT`: not owned; `SC_CELL_MARKUP`:\n owned by table."]
    pub text: *mut ScText,
    #[doc = " When `true`, `halign` overrides the column's horizontal alignment."]
    pub halign_set: bool,
    #[doc = " Horizontal alignment override; used only when `halign_set` is `true`."]
    pub halign: ScHAlign,
    #[doc = " When `true`, `valign` overrides the column's vertical alignment."]
    pub valign_set: bool,
    #[doc = " Vertical alignment override; effective only when `valign_set` is `true`."]
    pub valign: ScVAlign,
    #[doc = " Colspan: `0`/`1` = normal; `>1` = spans N columns; `-1` = skip (covered\n by a colspan)."]
    pub col_span: ::std::os::raw::c_int,
    #[doc = " Rowspan: `0`/`1` = normal; `>1` = spans N rows; `-1` = skip (covered\n by a rowspan)."]
    pub row_span: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScCell"][::std::mem::size_of::<ScCell>() - 48usize];
    ["Alignment of ScCell"][::std::mem::align_of::<ScCell>() - 8usize];
    ["Offset of field: ScCell::kind"][::std::mem::offset_of!(ScCell, kind) - 0usize];
    ["Offset of field: ScCell::str_"][::std::mem::offset_of!(ScCell, str_) - 8usize];
    ["Offset of field: ScCell::text"][::std::mem::offset_of!(ScCell, text) - 16usize];
    ["Offset of field: ScCell::halign_set"][::std::mem::offset_of!(ScCell, halign_set) - 24usize];
    ["Offset of field: ScCell::halign"][::std::mem::offset_of!(ScCell, halign) - 28usize];
    ["Offset of field: ScCell::valign_set"][::std::mem::offset_of!(ScCell, valign_set) - 32usize];
    ["Offset of field: ScCell::valign"][::std::mem::offset_of!(ScCell, valign) - 36usize];
    ["Offset of field: ScCell::col_span"][::std::mem::offset_of!(ScCell, col_span) - 40usize];
    ["Offset of field: ScCell::row_span"][::std::mem::offset_of!(ScCell, row_span) - 44usize];
};
extern "C" {
    #[doc = " Functional equivalents of the `sc_cell*` static-inline helpers above.\n\n Bindings that cannot consume `static inline` functions or C99 compound\n literals (Python via ctypes, some Rust binding setups) call these\n instead. Native C callers should prefer the inline forms."]
    pub fn sc_cell_from_str(str_: *const ::std::os::raw::c_char) -> ScCell;
}
extern "C" {
    pub fn sc_cell_str_aligned(
        str_: *const ::std::os::raw::c_char,
        halign: ScHAlign,
        valign: ScVAlign,
    ) -> ScCell;
}
extern "C" {
    pub fn sc_cell_from_text(text: *mut ScText) -> ScCell;
}
extern "C" {
    pub fn sc_cell_text_aligned(text: *mut ScText, halign: ScHAlign, valign: ScVAlign) -> ScCell;
}
extern "C" {
    pub fn sc_cell_colspan(
        str_: *const ::std::os::raw::c_char,
        col_span: ::std::os::raw::c_int,
    ) -> ScCell;
}
extern "C" {
    pub fn sc_cell_rowspan(
        str_: *const ::std::os::raw::c_char,
        row_span: ::std::os::raw::c_int,
    ) -> ScCell;
}
extern "C" {
    pub fn sc_cell_skip_placeholder() -> ScCell;
}
extern "C" {
    pub fn sc_row_skip_placeholder() -> ScCell;
}
extern "C" {
    pub fn sc_cell_from_markup(markup: *const ::std::os::raw::c_char) -> ScCell;
}
#[doc = " Per-column display options."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScColOpts {
    #[doc = " Minimum column width in terminal columns; `0` = no minimum."]
    pub min_width: ::std::os::raw::c_int,
    #[doc = " Maximum column width in terminal columns; `0` = no maximum."]
    pub max_width: ::std::os::raw::c_int,
    #[doc = " Fixed column width; `0` = auto; overrides `min_width`/`max_width`\n when `> 0`."]
    pub fixed_width: ::std::os::raw::c_int,
    #[doc = " Horizontal alignment of cell content."]
    pub halign: ScHAlign,
    #[doc = " Vertical alignment of cell content."]
    pub valign: ScVAlign,
    #[doc = " When `true`, wrap long lines on word boundaries;\n when `false`, truncate."]
    pub word_wrap: bool,
    #[doc = " Column background color; `SC_ANSI_COLOR_NONE` = not set."]
    pub bg: ScColor,
    #[doc = " Default text style (attributes + foreground) for unstyled cell spans\n in this column; zero-init = none. Lower priority than per-cell styling\n and the header/footer section styles. The style's `bg` is ignored -\n use the `bg` field above for column backgrounds."]
    pub style: ScTextStyle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScColOpts"][::std::mem::size_of::<ScColOpts>() - 52usize];
    ["Alignment of ScColOpts"][::std::mem::align_of::<ScColOpts>() - 4usize];
    ["Offset of field: ScColOpts::min_width"]
        [::std::mem::offset_of!(ScColOpts, min_width) - 0usize];
    ["Offset of field: ScColOpts::max_width"]
        [::std::mem::offset_of!(ScColOpts, max_width) - 4usize];
    ["Offset of field: ScColOpts::fixed_width"]
        [::std::mem::offset_of!(ScColOpts, fixed_width) - 8usize];
    ["Offset of field: ScColOpts::halign"][::std::mem::offset_of!(ScColOpts, halign) - 12usize];
    ["Offset of field: ScColOpts::valign"][::std::mem::offset_of!(ScColOpts, valign) - 16usize];
    ["Offset of field: ScColOpts::word_wrap"]
        [::std::mem::offset_of!(ScColOpts, word_wrap) - 20usize];
    ["Offset of field: ScColOpts::bg"][::std::mem::offset_of!(ScColOpts, bg) - 24usize];
    ["Offset of field: ScColOpts::style"][::std::mem::offset_of!(ScColOpts, style) - 32usize];
};
#[doc = " Border style and color settings for a table."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScTableBorder {
    #[doc = " Border style (none, ascii, single, double, rounded, thick)."]
    pub type_: ScBorderType,
    #[doc = " Color of the outer frame."]
    pub outer_color: ScColor,
    #[doc = " Color of inner row and column separators."]
    pub inner_color: ScColor,
    #[doc = " Color of the header/data separator line; falls back to `inner_color`\n when not set."]
    pub header_row_sep_color: ScColor,
    #[doc = " Color of the header column separator; falls back to `inner_color`\n when not set."]
    pub header_col_sep_color: ScColor,
    #[doc = " When `true`, suppress the outer frame entirely."]
    pub no_outer: bool,
    #[doc = " When `true`, suppress inner horizontal (row) separators."]
    pub no_inner_h: bool,
    #[doc = " When `true`, suppress inner vertical (column) separators (except the\n header column)."]
    pub no_inner_v: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScTableBorder"][::std::mem::size_of::<ScTableBorder>() - 40usize];
    ["Alignment of ScTableBorder"][::std::mem::align_of::<ScTableBorder>() - 4usize];
    ["Offset of field: ScTableBorder::type_"]
        [::std::mem::offset_of!(ScTableBorder, type_) - 0usize];
    ["Offset of field: ScTableBorder::outer_color"]
        [::std::mem::offset_of!(ScTableBorder, outer_color) - 4usize];
    ["Offset of field: ScTableBorder::inner_color"]
        [::std::mem::offset_of!(ScTableBorder, inner_color) - 12usize];
    ["Offset of field: ScTableBorder::header_row_sep_color"]
        [::std::mem::offset_of!(ScTableBorder, header_row_sep_color) - 20usize];
    ["Offset of field: ScTableBorder::header_col_sep_color"]
        [::std::mem::offset_of!(ScTableBorder, header_col_sep_color) - 28usize];
    ["Offset of field: ScTableBorder::no_outer"]
        [::std::mem::offset_of!(ScTableBorder, no_outer) - 36usize];
    ["Offset of field: ScTableBorder::no_inner_h"]
        [::std::mem::offset_of!(ScTableBorder, no_inner_h) - 37usize];
    ["Offset of field: ScTableBorder::no_inner_v"]
        [::std::mem::offset_of!(ScTableBorder, no_inner_v) - 38usize];
};
#[doc = " Header row and column settings."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScTableHeader {
    #[doc = " When `true`, treat the first added row as the header row."]
    pub row: bool,
    #[doc = " When `true`, treat the first column as a header column."]
    pub col: bool,
    #[doc = " Background color for the header row."]
    pub row_bg: ScColor,
    #[doc = " Background color for the header column."]
    pub col_bg: ScColor,
    #[doc = " Text style applied to all header cells."]
    pub style: ScTextStyle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScTableHeader"][::std::mem::size_of::<ScTableHeader>() - 40usize];
    ["Alignment of ScTableHeader"][::std::mem::align_of::<ScTableHeader>() - 4usize];
    ["Offset of field: ScTableHeader::row"][::std::mem::offset_of!(ScTableHeader, row) - 0usize];
    ["Offset of field: ScTableHeader::col"][::std::mem::offset_of!(ScTableHeader, col) - 1usize];
    ["Offset of field: ScTableHeader::row_bg"]
        [::std::mem::offset_of!(ScTableHeader, row_bg) - 4usize];
    ["Offset of field: ScTableHeader::col_bg"]
        [::std::mem::offset_of!(ScTableHeader, col_bg) - 12usize];
    ["Offset of field: ScTableHeader::style"]
        [::std::mem::offset_of!(ScTableHeader, style) - 20usize];
};
#[doc = " Footer row and column settings."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScTableFooter {
    #[doc = " Background color for footer rows."]
    pub row_bg: ScColor,
    #[doc = " Background color for the footer column."]
    pub col_bg: ScColor,
    #[doc = " Text style applied to all footer cells."]
    pub style: ScTextStyle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScTableFooter"][::std::mem::size_of::<ScTableFooter>() - 36usize];
    ["Alignment of ScTableFooter"][::std::mem::align_of::<ScTableFooter>() - 4usize];
    ["Offset of field: ScTableFooter::row_bg"]
        [::std::mem::offset_of!(ScTableFooter, row_bg) - 0usize];
    ["Offset of field: ScTableFooter::col_bg"]
        [::std::mem::offset_of!(ScTableFooter, col_bg) - 8usize];
    ["Offset of field: ScTableFooter::style"]
        [::std::mem::offset_of!(ScTableFooter, style) - 16usize];
};
#[doc = " Rendering options passed to `sc_table_print()`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScTableOpts {
    #[doc = " Border style and color settings."]
    pub border: ScTableBorder,
    #[doc = " Header row and column settings."]
    pub header: ScTableHeader,
    #[doc = " When `true`, apply alternating background colors to data rows."]
    pub striped: bool,
    #[doc = " Background color for odd-indexed (0-based) data rows when `striped`\n is `true`."]
    pub stripe_bg: ScColor,
    #[doc = " Footer row and column settings."]
    pub footer: ScTableFooter,
    #[doc = " Table title (text, style, alignment, position)."]
    pub title: ScTitle,
    #[doc = " Inner cell padding (top/right/bottom/left)."]
    pub cell_pad: ScEdges,
    #[doc = " Outer table margin (top/right/bottom/left)."]
    pub margin: ScEdges,
    #[doc = " `0` = auto-size; `>0` = distribute total width across flex columns."]
    pub total_width: ::std::os::raw::c_int,
    #[doc = " `0` = unlimited; `>0` = truncate data rows at this count, with an\nindicator."]
    pub max_rows: ::std::os::raw::c_int,
    #[doc = " When `true`, reverse the display order of columns."]
    pub right_to_left: bool,
    #[doc = " ANSI passthrough for cell and title strings; zero-init inherits the\n `sc_set_allow_ansi` global."]
    pub ansi: ScAnsiMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScTableOpts"][::std::mem::size_of::<ScTableOpts>() - 224usize];
    ["Alignment of ScTableOpts"][::std::mem::align_of::<ScTableOpts>() - 8usize];
    ["Offset of field: ScTableOpts::border"][::std::mem::offset_of!(ScTableOpts, border) - 0usize];
    ["Offset of field: ScTableOpts::header"][::std::mem::offset_of!(ScTableOpts, header) - 40usize];
    ["Offset of field: ScTableOpts::striped"]
        [::std::mem::offset_of!(ScTableOpts, striped) - 80usize];
    ["Offset of field: ScTableOpts::stripe_bg"]
        [::std::mem::offset_of!(ScTableOpts, stripe_bg) - 84usize];
    ["Offset of field: ScTableOpts::footer"][::std::mem::offset_of!(ScTableOpts, footer) - 92usize];
    ["Offset of field: ScTableOpts::title"][::std::mem::offset_of!(ScTableOpts, title) - 128usize];
    ["Offset of field: ScTableOpts::cell_pad"]
        [::std::mem::offset_of!(ScTableOpts, cell_pad) - 176usize];
    ["Offset of field: ScTableOpts::margin"]
        [::std::mem::offset_of!(ScTableOpts, margin) - 192usize];
    ["Offset of field: ScTableOpts::total_width"]
        [::std::mem::offset_of!(ScTableOpts, total_width) - 208usize];
    ["Offset of field: ScTableOpts::max_rows"]
        [::std::mem::offset_of!(ScTableOpts, max_rows) - 212usize];
    ["Offset of field: ScTableOpts::right_to_left"]
        [::std::mem::offset_of!(ScTableOpts, right_to_left) - 216usize];
    ["Offset of field: ScTableOpts::ansi"][::std::mem::offset_of!(ScTableOpts, ansi) - 220usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScTableData {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Allocates an empty table. Free with `sc_table_free`.\n\n @return  Heap-allocated table; `NULL` on allocation failure."]
    pub fn sc_table_new() -> *mut ScTableData;
}
extern "C" {
    #[doc = " Appends a column with the given header and per-column options.\n\n @param table     Target table; no-op when `NULL`.\n @param header    Column header string; copied internally; may be `NULL`.\n @param col_opts  Per-column display options.\n\n @note `header` is `strdup`-ed; the caller may free it immediately\n after this call returns."]
    pub fn sc_table_add_column(
        table: *mut ScTableData,
        header: *const ::std::os::raw::c_char,
        col_opts: ScColOpts,
    );
}
extern "C" {
    #[doc = " Appends a data row. The cells are copied into the table.\n\n @param table       Target table; no-op when `NULL`.\n @param cells       Cell array; one entry per column. Cells beyond\n                    `cell_count` are filled with empty cells.\n @param cell_count  Number of valid entries in `cells`.\n\n @note For `SC_CELL_STR` and `SC_CELL_TEXT` cells the table stores the\n original pointers (`ScCell.str` is `const char *`; `ScCell.text` is\n `ScText *`). Those strings/objects must outlive the next\n `sc_table_print`. For `SC_CELL_MARKUP` cells the table takes\n ownership of the parsed `ScText`."]
    pub fn sc_table_add_row(table: *mut ScTableData, cells: *mut ScCell, cell_count: usize);
}
extern "C" {
    #[doc = " Same as `sc_table_add_row`, but sets an explicit row background."]
    pub fn sc_table_add_row_bg(
        table: *mut ScTableData,
        cells: *mut ScCell,
        cell_count: usize,
        bg: ScColor,
    );
}
extern "C" {
    #[doc = " Appends a footer row; same ownership rules as `sc_table_add_row`."]
    pub fn sc_table_add_footer_row(table: *mut ScTableData, cells: *mut ScCell, cell_count: usize);
}
extern "C" {
    #[doc = " Renders `table` to the current output stream.\n\n @param table  Borrowed table; not retained or modified.\n @param opts   Rendering options (passed by value)."]
    pub fn sc_table_print(table: *const ScTableData, opts: ScTableOpts);
}
extern "C" {
    #[doc = " Frees `table` and any owned cells (including the `ScText` of\n `SC_CELL_MARKUP` cells). Safe to call with `NULL`."]
    pub fn sc_table_free(table: *mut ScTableData);
}
#[doc = " Rendering options for a horizontal rule."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScRuleOpts {
    #[doc = " Border style; determines which `h` character is used for the line."]
    pub type_: ScBorderType,
    #[doc = " Line color; `SC_ANSI_COLOR_NONE` = no escape codes."]
    pub color: ScColor,
    #[doc = " Title label embedded in the line; `title.text = NULL` = no title.\n `pos` is ignored."]
    pub title: ScTitle,
    #[doc = " `0` = full terminal width; `>0` = fixed character width."]
    pub width: ::std::os::raw::c_int,
    #[doc = " Horizontal placement of the rule when `width > 0`."]
    pub halign: ScHAlign,
    #[doc = " Outer margin; top/bottom = blank lines, left/right = indent spaces."]
    pub margin: ScEdges,
    #[doc = " ANSI passthrough for the title string; zero-init inherits the\n `sc_set_allow_ansi` global."]
    pub ansi: ScAnsiMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScRuleOpts"][::std::mem::size_of::<ScRuleOpts>() - 96usize];
    ["Alignment of ScRuleOpts"][::std::mem::align_of::<ScRuleOpts>() - 8usize];
    ["Offset of field: ScRuleOpts::type_"][::std::mem::offset_of!(ScRuleOpts, type_) - 0usize];
    ["Offset of field: ScRuleOpts::color"][::std::mem::offset_of!(ScRuleOpts, color) - 4usize];
    ["Offset of field: ScRuleOpts::title"][::std::mem::offset_of!(ScRuleOpts, title) - 16usize];
    ["Offset of field: ScRuleOpts::width"][::std::mem::offset_of!(ScRuleOpts, width) - 64usize];
    ["Offset of field: ScRuleOpts::halign"][::std::mem::offset_of!(ScRuleOpts, halign) - 68usize];
    ["Offset of field: ScRuleOpts::margin"][::std::mem::offset_of!(ScRuleOpts, margin) - 72usize];
    ["Offset of field: ScRuleOpts::ansi"][::std::mem::offset_of!(ScRuleOpts, ansi) - 88usize];
};
extern "C" {
    #[doc = " Renders a horizontal rule with an optional plain-string title.\n\n @param title  Title text embedded in the line; `NULL` = no title.\n @param opts   Rendering options (style, color, width, alignment, margin)."]
    pub fn sc_rule_str(title: *const ::std::os::raw::c_char, opts: ScRuleOpts);
}
extern "C" {
    #[doc = " Renders a horizontal rule with an optional rich-text title.\n\n @param title  Rich-text title embedded in the line; `NULL` = no title.\n @param opts   Rendering options (style, color, width, alignment, margin)."]
    pub fn sc_rule_text(title: *const ScText, opts: ScRuleOpts);
}
#[doc = "< Fixed character (default `•`); see opts.bullet"]
pub const ScListMarker_SC_LIST_BULLET: ScListMarker = 0;
#[doc = "< `1`, `2`, `3`, … (decimal counter)"]
pub const ScListMarker_SC_LIST_NUMBER: ScListMarker = 1;
#[doc = "< `a`, `b`, `c`, … (lowercase Latin letters)"]
pub const ScListMarker_SC_LIST_ALPHA_LC: ScListMarker = 2;
#[doc = "< `A`, `B`, `C`, … (uppercase Latin letters)"]
pub const ScListMarker_SC_LIST_ALPHA_UC: ScListMarker = 3;
#[doc = "< `i`, `ii`, `iii`, … (lowercase Roman numerals)"]
pub const ScListMarker_SC_LIST_ROMAN_LC: ScListMarker = 4;
#[doc = "< `I`, `II`, `III`, … (uppercase Roman numerals)"]
pub const ScListMarker_SC_LIST_ROMAN_UC: ScListMarker = 5;
#[doc = " Marker style used in front of each list item."]
pub type ScListMarker = ::std::os::raw::c_uint;
#[doc = " Rendering options for a list."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScListOpts {
    #[doc = " Marker style (bullet, number, letter, Roman)."]
    pub marker: ScListMarker,
    #[doc = " Bullet character used when `marker == SC_LIST_BULLET`; `NULL` = `•`."]
    pub bullet: *const ::std::os::raw::c_char,
    #[doc = " Text before the marker value (e.g. `\"(\"` → `(1`); default `\"\"`."]
    pub marker_prefix: *const ::std::os::raw::c_char,
    #[doc = " Text after the marker value (e.g. `\".\"` → `1.`); default `\".\"`."]
    pub marker_suffix: *const ::std::os::raw::c_char,
    #[doc = " Style applied to the full marker field; zero-init = no formatting."]
    pub marker_style: ScTextStyle,
    #[doc = " Left indent relative to the parent list, in columns."]
    pub indent: ::std::os::raw::c_int,
    #[doc = " Blank lines inserted between items; `0` = none."]
    pub item_gap: ::std::os::raw::c_int,
    #[doc = " Total line width in columns; `0` = terminal width."]
    pub width: ::std::os::raw::c_int,
    #[doc = " Outer margin; top/bottom = blank lines, left/right = outer indent\n in columns."]
    pub margin: ScEdges,
    #[doc = " ANSI passthrough for item strings; zero-init inherits the\n `sc_set_allow_ansi` global."]
    pub ansi: ScAnsiMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScListOpts"][::std::mem::size_of::<ScListOpts>() - 88usize];
    ["Alignment of ScListOpts"][::std::mem::align_of::<ScListOpts>() - 8usize];
    ["Offset of field: ScListOpts::marker"][::std::mem::offset_of!(ScListOpts, marker) - 0usize];
    ["Offset of field: ScListOpts::bullet"][::std::mem::offset_of!(ScListOpts, bullet) - 8usize];
    ["Offset of field: ScListOpts::marker_prefix"]
        [::std::mem::offset_of!(ScListOpts, marker_prefix) - 16usize];
    ["Offset of field: ScListOpts::marker_suffix"]
        [::std::mem::offset_of!(ScListOpts, marker_suffix) - 24usize];
    ["Offset of field: ScListOpts::marker_style"]
        [::std::mem::offset_of!(ScListOpts, marker_style) - 32usize];
    ["Offset of field: ScListOpts::indent"][::std::mem::offset_of!(ScListOpts, indent) - 52usize];
    ["Offset of field: ScListOpts::item_gap"]
        [::std::mem::offset_of!(ScListOpts, item_gap) - 56usize];
    ["Offset of field: ScListOpts::width"][::std::mem::offset_of!(ScListOpts, width) - 60usize];
    ["Offset of field: ScListOpts::margin"][::std::mem::offset_of!(ScListOpts, margin) - 64usize];
    ["Offset of field: ScListOpts::ansi"][::std::mem::offset_of!(ScListOpts, ansi) - 80usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScList {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScListItem {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Allocates an empty list.\n\n @param opts  Rendering options (marker, indent, width, …). Copied\n              internally, including the marker strings (`bullet`,\n              `marker_prefix`, `marker_suffix`); the caller's buffers only\n              need to live until this call returns.\n @return      Heap-allocated list; free with `sc_list_free`."]
    pub fn sc_list_new(opts: ScListOpts) -> *mut ScList;
}
extern "C" {
    #[doc = " Appends a plain-string item to `list`.\n\n @param list   List the item is appended to.\n @param str    Item text; copied internally.\n @param style  Style applied to `str`.\n @return       Pointer to the new item; owned by the list."]
    pub fn sc_list_add_str(
        list: *mut ScList,
        str_: *const ::std::os::raw::c_char,
        style: ScTextStyle,
    ) -> *mut ScListItem;
}
extern "C" {
    #[doc = " Appends a rich-text item to `list`.\n\n @param list  List the item is appended to.\n @param text  Rich-text content; not owned by the list.\n @return      Pointer to the new item; owned by the list."]
    pub fn sc_list_add_text(list: *mut ScList, text: *const ScText) -> *mut ScListItem;
}
extern "C" {
    #[doc = " Attaches a sub-list to `parent`.\n\n Replaces any previously attached sub-list. The returned list is owned by\n `parent` and is freed together with the outer list.\n\n @param parent  Item the sub-list is attached to.\n @param opts    Rendering options for the sub-list; copied like in\n                `sc_list_new`.\n @return        Newly allocated sub-list; owned by `parent`."]
    pub fn sc_list_add_sub(parent: *mut ScListItem, opts: ScListOpts) -> *mut ScList;
}
extern "C" {
    #[doc = " Renders `list` to stdout.\n\n @param list  List to render; no output when `list` is `NULL`."]
    pub fn sc_list_print(list: *const ScList);
}
extern "C" {
    #[doc = " Frees `list`, all its items and any attached sub-lists.\n\n @param list  List to free; safe to pass `NULL`."]
    pub fn sc_list_free(list: *mut ScList);
}
#[doc = " Rendering options for a tree layout."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScTreeOpts {
    #[doc = " Connector style; selects the box-drawing set for branches and guides."]
    pub type_: ScBorderType,
    #[doc = " Connector color; `SC_ANSI_COLOR_NONE` = no escape codes."]
    pub connector_color: ScColor,
    #[doc = " Spaces between the connector and the node text; default `1`."]
    pub indent: ::std::os::raw::c_int,
    #[doc = " When `true`, suppress vertical continuation guides under finished\nbranches."]
    pub no_guide: bool,
    #[doc = " ANSI passthrough for node strings; zero-init inherits the\n `sc_set_allow_ansi` global."]
    pub ansi: ScAnsiMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScTreeOpts"][::std::mem::size_of::<ScTreeOpts>() - 24usize];
    ["Alignment of ScTreeOpts"][::std::mem::align_of::<ScTreeOpts>() - 4usize];
    ["Offset of field: ScTreeOpts::type_"][::std::mem::offset_of!(ScTreeOpts, type_) - 0usize];
    ["Offset of field: ScTreeOpts::connector_color"]
        [::std::mem::offset_of!(ScTreeOpts, connector_color) - 4usize];
    ["Offset of field: ScTreeOpts::indent"][::std::mem::offset_of!(ScTreeOpts, indent) - 12usize];
    ["Offset of field: ScTreeOpts::no_guide"]
        [::std::mem::offset_of!(ScTreeOpts, no_guide) - 16usize];
    ["Offset of field: ScTreeOpts::ansi"][::std::mem::offset_of!(ScTreeOpts, ansi) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScTree {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScTreeNode {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Allocates an empty tree.\n\n @param opts  Rendering options (style, color, indent, guide).\n @return      Heap-allocated tree; free with `sc_tree_free`."]
    pub fn sc_tree_new(opts: ScTreeOpts) -> *mut ScTree;
}
extern "C" {
    #[doc = " Attaches a plain-string node to `tree`.\n\n @param tree         Tree the node is added to.\n @param parent       Parent node; `NULL` adds a new root.\n @param str          Node text; copied internally.\n @param style        Style applied to `str`.\n @param prefix       Optional marker printed before `str`; may be `NULL`.\n @param prefix_style Style applied to `prefix`.\n @return             Pointer to the new node; owned by the tree."]
    pub fn sc_tree_add_str(
        tree: *mut ScTree,
        parent: *mut ScTreeNode,
        str_: *const ::std::os::raw::c_char,
        style: ScTextStyle,
        prefix: *const ::std::os::raw::c_char,
        prefix_style: ScTextStyle,
    ) -> *mut ScTreeNode;
}
extern "C" {
    #[doc = " Attaches a rich-text node to `tree`.\n\n @param tree         Tree the node is added to.\n @param parent       Parent node; `NULL` adds a new root.\n @param text         Rich-text content; not owned by the tree.\n @param prefix       Optional marker printed before `text`; may be `NULL`.\n @param prefix_style Style applied to `prefix`.\n @return             Pointer to the new node; owned by the tree."]
    pub fn sc_tree_add_text(
        tree: *mut ScTree,
        parent: *mut ScTreeNode,
        text: *const ScText,
        prefix: *const ::std::os::raw::c_char,
        prefix_style: ScTextStyle,
    ) -> *mut ScTreeNode;
}
extern "C" {
    #[doc = " Renders `tree` to stdout.\n\n @param tree  Tree to render; no output when `tree` is `NULL` or empty."]
    pub fn sc_tree_print(tree: *const ScTree);
}
extern "C" {
    #[doc = " Frees `tree`, all its nodes, and any owned strings.\n\n @param tree  Tree to free; safe to pass `NULL`."]
    pub fn sc_tree_free(tree: *mut ScTree);
}
#[doc = " Per-column options passed alongside a captured widget.\n\n Width priority: `fixed_w` (when `> 0`) overrides `min_w`/`max_w`;\n otherwise the natural content width is clamped to `[min_w, max_w]`\n when those are set."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScColItem {
    #[doc = " Minimum column width in columns; `0` = no minimum."]
    pub min_w: ::std::os::raw::c_int,
    #[doc = " Maximum column width in columns; `0` = no maximum."]
    pub max_w: ::std::os::raw::c_int,
    #[doc = " Fixed column width; `0` = auto. Overrides `min_w`/`max_w` when `> 0`."]
    pub fixed_w: ::std::os::raw::c_int,
    #[doc = " Horizontal placement of the content when the column is wider."]
    pub halign: ScHAlign,
    #[doc = " When `true`, `valign` overrides `ScColumnsOpts.valign` for this col."]
    pub valign_set: bool,
    #[doc = " Vertical alignment override; used only when `valign_set` is `true`."]
    pub valign: ScVAlign,
    #[doc = " Background color filling padding spaces and empty slots; zero-init =\n no color. Does not affect the captured widget content itself."]
    pub bg: ScColor,
    #[doc = " When `true`, extend the captured panel to the full column height."]
    pub stretch: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScColItem"][::std::mem::size_of::<ScColItem>() - 36usize];
    ["Alignment of ScColItem"][::std::mem::align_of::<ScColItem>() - 4usize];
    ["Offset of field: ScColItem::min_w"][::std::mem::offset_of!(ScColItem, min_w) - 0usize];
    ["Offset of field: ScColItem::max_w"][::std::mem::offset_of!(ScColItem, max_w) - 4usize];
    ["Offset of field: ScColItem::fixed_w"][::std::mem::offset_of!(ScColItem, fixed_w) - 8usize];
    ["Offset of field: ScColItem::halign"][::std::mem::offset_of!(ScColItem, halign) - 12usize];
    ["Offset of field: ScColItem::valign_set"]
        [::std::mem::offset_of!(ScColItem, valign_set) - 16usize];
    ["Offset of field: ScColItem::valign"][::std::mem::offset_of!(ScColItem, valign) - 20usize];
    ["Offset of field: ScColItem::bg"][::std::mem::offset_of!(ScColItem, bg) - 24usize];
    ["Offset of field: ScColItem::stretch"][::std::mem::offset_of!(ScColItem, stretch) - 32usize];
};
#[doc = " Layout options applied to a `ScColumns` container."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScColumnsOpts {
    #[doc = " Space between columns; default `3` without a separator, `2` with one\n (added on both sides of the separator)."]
    pub gap: ::std::os::raw::c_int,
    #[doc = " Separator style, color and bg; zero-init = no separator."]
    pub sep: ScBorderStyle,
    #[doc = " Default vertical alignment per column; overridable per `ScColItem`."]
    pub valign: ScVAlign,
    #[doc = " `0` = auto; `>0` = distribute width across flex columns."]
    pub total_width: ::std::os::raw::c_int,
    #[doc = " Outer margin (top/right/bottom/left)."]
    pub margin: ScEdges,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScColumnsOpts"][::std::mem::size_of::<ScColumnsOpts>() - 48usize];
    ["Alignment of ScColumnsOpts"][::std::mem::align_of::<ScColumnsOpts>() - 4usize];
    ["Offset of field: ScColumnsOpts::gap"][::std::mem::offset_of!(ScColumnsOpts, gap) - 0usize];
    ["Offset of field: ScColumnsOpts::sep"][::std::mem::offset_of!(ScColumnsOpts, sep) - 4usize];
    ["Offset of field: ScColumnsOpts::valign"]
        [::std::mem::offset_of!(ScColumnsOpts, valign) - 24usize];
    ["Offset of field: ScColumnsOpts::total_width"]
        [::std::mem::offset_of!(ScColumnsOpts, total_width) - 28usize];
    ["Offset of field: ScColumnsOpts::margin"]
        [::std::mem::offset_of!(ScColumnsOpts, margin) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScColumns {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Allocates an empty columns layout.\n\n @param opts  Layout options.\n @return      Heap-allocated layout; free with `sc_columns_free`."]
    pub fn sc_columns_new(opts: ScColumnsOpts) -> *mut ScColumns;
}
extern "C" {
    #[doc = " Captures a table and appends it as a column.\n\n The table is rendered into a temporary buffer **at call time** and the\n resulting frozen rendering is stored. The caller may freely modify or\n free `table` afterwards - the columns layout no longer references it.\n\n @param columns  Layout the column is appended to.\n @param table    Source table; rendered at call time, then no longer\n                 referenced.\n @param opts     Table rendering options (passed by value).\n @param item     Per-column options."]
    pub fn sc_columns_add_table(
        columns: *mut ScColumns,
        table: *const ScTableData,
        opts: ScTableOpts,
        item: ScColItem,
    );
}
extern "C" {
    #[doc = " Captures a plain-string panel and appends it as a column.\n\n Same snapshot semantics as `sc_columns_add_table`: the panel is\n rendered into a frozen buffer at call time, `content` is no longer\n referenced after the call."]
    pub fn sc_columns_add_panel_str(
        columns: *mut ScColumns,
        content: *const ::std::os::raw::c_char,
        opts: ScPanelOpts,
        item: ScColItem,
    );
}
extern "C" {
    #[doc = " Same snapshot semantics as `sc_columns_add_panel_str`."]
    pub fn sc_columns_add_panel_text(
        columns: *mut ScColumns,
        content: *const ScText,
        opts: ScPanelOpts,
        item: ScColItem,
    );
}
extern "C" {
    #[doc = " Same snapshot semantics as `sc_columns_add_table`; captures `text`."]
    pub fn sc_columns_add_text(columns: *mut ScColumns, text: *const ScText, item: ScColItem);
}
extern "C" {
    #[doc = " Same snapshot semantics as `sc_columns_add_table`; captures `str`."]
    pub fn sc_columns_add_str(
        columns: *mut ScColumns,
        str_: *const ::std::os::raw::c_char,
        item: ScColItem,
    );
}
extern "C" {
    #[doc = " Captures a nested columns layout and appends it as a column.\n\n The nested layout is rendered into a frozen buffer at call time; later\n modifications to `nested` have no effect on the captured snapshot."]
    pub fn sc_columns_add_columns(
        columns: *mut ScColumns,
        nested: *const ScColumns,
        item: ScColItem,
    );
}
extern "C" {
    #[doc = " Same snapshot semantics as `sc_columns_add_table`; captures `tree`."]
    pub fn sc_columns_add_tree(columns: *mut ScColumns, tree: *const ScTree, item: ScColItem);
}
extern "C" {
    #[doc = " Same snapshot semantics as `sc_columns_add_table`; captures `list`."]
    pub fn sc_columns_add_list(columns: *mut ScColumns, list: *const ScList, item: ScColItem);
}
extern "C" {
    #[doc = " Appends an already-captured `ScRendered` as a column.\n\n The columns layout makes a deep copy, so the caller may free `rendered`\n immediately after."]
    pub fn sc_columns_add_rendered(
        columns: *mut ScColumns,
        rendered: *const ScRendered,
        item: ScColItem,
    );
}
extern "C" {
    #[doc = " Renders the columns layout to stdout."]
    pub fn sc_columns_print(columns: *const ScColumns);
}
extern "C" {
    #[doc = " Frees `columns`, all its captured entries and any owned strings.\n\n @param columns  Layout to free; safe to pass `NULL`."]
    pub fn sc_columns_free(columns: *mut ScColumns);
}
#[doc = "< `█` fill, `░` empty (Unicode blocks)"]
pub const ScProgressType_SC_PROGRESS_BLOCK: ScProgressType = 0;
#[doc = "< `=` fill with `>` edge, space empty"]
pub const ScProgressType_SC_PROGRESS_ASCII: ScProgressType = 1;
#[doc = "< `━` fill, `╌` empty (heavy horizontal)"]
pub const ScProgressType_SC_PROGRESS_LINE: ScProgressType = 2;
#[doc = "< `▓` fill with `▒` edge, `░` empty (shaded)"]
pub const ScProgressType_SC_PROGRESS_SHADED: ScProgressType = 3;
#[doc = " Visual style of the progress bar's fill and empty cells."]
pub type ScProgressType = ::std::os::raw::c_uint;
#[doc = " Optional color thresholds for the bar's fill.\n\n When `enabled` is `true`, the fill color switches based on the current\n ratio: `< mid` uses `color_low`, `>= mid` uses `color_mid`,\n `>= high` uses `color_high`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScProgressThresholds {
    #[doc = " When `true`, the fill color is selected from the ratio."]
    pub enabled: bool,
    #[doc = " Ratio at which `color_mid` takes effect; default `0.5`."]
    pub mid: f64,
    #[doc = " Ratio at which `color_high` takes effect; default `0.75`."]
    pub high: f64,
    #[doc = " Fill color used while `ratio < mid`."]
    pub color_low: ScColor,
    #[doc = " Fill color used while `mid <= ratio < high`."]
    pub color_mid: ScColor,
    #[doc = " Fill color used while `ratio >= high`."]
    pub color_high: ScColor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScProgressThresholds"][::std::mem::size_of::<ScProgressThresholds>() - 48usize];
    ["Alignment of ScProgressThresholds"][::std::mem::align_of::<ScProgressThresholds>() - 8usize];
    ["Offset of field: ScProgressThresholds::enabled"]
        [::std::mem::offset_of!(ScProgressThresholds, enabled) - 0usize];
    ["Offset of field: ScProgressThresholds::mid"]
        [::std::mem::offset_of!(ScProgressThresholds, mid) - 8usize];
    ["Offset of field: ScProgressThresholds::high"]
        [::std::mem::offset_of!(ScProgressThresholds, high) - 16usize];
    ["Offset of field: ScProgressThresholds::color_low"]
        [::std::mem::offset_of!(ScProgressThresholds, color_low) - 24usize];
    ["Offset of field: ScProgressThresholds::color_mid"]
        [::std::mem::offset_of!(ScProgressThresholds, color_mid) - 32usize];
    ["Offset of field: ScProgressThresholds::color_high"]
        [::std::mem::offset_of!(ScProgressThresholds, color_high) - 40usize];
};
#[doc = " Rendering options for a progress bar."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScProgressBarOpts {
    #[doc = " Fill style (block, ascii, line, shaded)."]
    pub type_: ScProgressType,
    #[doc = " Left bracket string; `NULL` = no left cap."]
    pub left_cap: *const ::std::os::raw::c_char,
    #[doc = " Right bracket string; `NULL` = no right cap."]
    pub right_cap: *const ::std::os::raw::c_char,
    #[doc = " Fill color; zero-init = no color. Overridden by thresholds when set."]
    pub fill_color: ScColor,
    #[doc = " Empty cell color; zero-init = no color."]
    pub empty_color: ScColor,
    #[doc = " Optional threshold-based fill colors."]
    pub thresholds: ScProgressThresholds,
    #[doc = " When `true`, append `XX%` after the bar."]
    pub show_percent: bool,
    #[doc = " When `true` and `max > 0`, append `(value/max)` after the percent."]
    pub show_value: bool,
    #[doc = " Fixed bar width in cells; `0` = derive from `width`."]
    pub bar_width: ::std::os::raw::c_int,
    #[doc = " Total line width in columns; `0` = terminal width."]
    pub width: ::std::os::raw::c_int,
    #[doc = " Fixed label column width; `0` = use natural label width."]
    pub label_width: ::std::os::raw::c_int,
    #[doc = " Style applied to the label text; zero-init = no formatting."]
    pub label_style: ScTextStyle,
    #[doc = " ANSI passthrough for the label; zero-init inherits the\n `sc_set_allow_ansi` global."]
    pub ansi: ScAnsiMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScProgressBarOpts"][::std::mem::size_of::<ScProgressBarOpts>() - 128usize];
    ["Alignment of ScProgressBarOpts"][::std::mem::align_of::<ScProgressBarOpts>() - 8usize];
    ["Offset of field: ScProgressBarOpts::type_"]
        [::std::mem::offset_of!(ScProgressBarOpts, type_) - 0usize];
    ["Offset of field: ScProgressBarOpts::left_cap"]
        [::std::mem::offset_of!(ScProgressBarOpts, left_cap) - 8usize];
    ["Offset of field: ScProgressBarOpts::right_cap"]
        [::std::mem::offset_of!(ScProgressBarOpts, right_cap) - 16usize];
    ["Offset of field: ScProgressBarOpts::fill_color"]
        [::std::mem::offset_of!(ScProgressBarOpts, fill_color) - 24usize];
    ["Offset of field: ScProgressBarOpts::empty_color"]
        [::std::mem::offset_of!(ScProgressBarOpts, empty_color) - 32usize];
    ["Offset of field: ScProgressBarOpts::thresholds"]
        [::std::mem::offset_of!(ScProgressBarOpts, thresholds) - 40usize];
    ["Offset of field: ScProgressBarOpts::show_percent"]
        [::std::mem::offset_of!(ScProgressBarOpts, show_percent) - 88usize];
    ["Offset of field: ScProgressBarOpts::show_value"]
        [::std::mem::offset_of!(ScProgressBarOpts, show_value) - 89usize];
    ["Offset of field: ScProgressBarOpts::bar_width"]
        [::std::mem::offset_of!(ScProgressBarOpts, bar_width) - 92usize];
    ["Offset of field: ScProgressBarOpts::width"]
        [::std::mem::offset_of!(ScProgressBarOpts, width) - 96usize];
    ["Offset of field: ScProgressBarOpts::label_width"]
        [::std::mem::offset_of!(ScProgressBarOpts, label_width) - 100usize];
    ["Offset of field: ScProgressBarOpts::label_style"]
        [::std::mem::offset_of!(ScProgressBarOpts, label_style) - 104usize];
    ["Offset of field: ScProgressBarOpts::ansi"]
        [::std::mem::offset_of!(ScProgressBarOpts, ansi) - 124usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScProgressBar {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Allocates a new progress bar.\n\n @param opts  Rendering options. Copied internally, including the cap\n              strings (`left_cap`, `right_cap`); the caller's buffers only\n              need to live until this call returns.\n @return      Heap-allocated bar; free with `sc_progressbar_free`."]
    pub fn sc_progressbar_new(opts: ScProgressBarOpts) -> *mut ScProgressBar;
}
extern "C" {
    #[doc = " Sets or replaces the label printed in front of the bar.\n\n @param bar    Bar to update.\n @param label  New label; copied internally; `NULL` removes the label."]
    pub fn sc_progressbar_set_label(bar: *mut ScProgressBar, label: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Renders one frame of the bar followed by `\\\\r` so the next call\n overwrites it in place.\n\n @param bar    Bar to render.\n @param value  Current value; treated as a `0.0`-`1.0` ratio when `max == 0`.\n @param max    Maximum value; `0` switches to ratio mode."]
    pub fn sc_progressbar_draw(bar: *mut ScProgressBar, value: f64, max: f64);
}
extern "C" {
    #[doc = " Renders the final bar frame followed by `\\\\n`, ending the animation.\n\n @param bar    Bar to finalize.\n @param value  Current value; see `sc_progressbar_draw`.\n @param max    Maximum value; see `sc_progressbar_draw`."]
    pub fn sc_progressbar_finish(bar: *mut ScProgressBar, value: f64, max: f64);
}
extern "C" {
    #[doc = " Frees `bar` and the owned label string.\n\n @param bar  Bar to free; safe to pass `NULL`."]
    pub fn sc_progressbar_free(bar: *mut ScProgressBar);
}
#[doc = "< `⠋⠙⠹⠸⠼⠴⠦⠧⠇⠏` (10 frames, Braille dots)"]
pub const ScSpinnerType_SC_SPINNER_BRAILLE: ScSpinnerType = 0;
#[doc = "< `|/-\\` (4 frames, ASCII)"]
pub const ScSpinnerType_SC_SPINNER_PIPE: ScSpinnerType = 1;
#[doc = "< `⣾⣽⣻⢿⡿⣟⣯⣷` (8 frames, dense Braille)"]
pub const ScSpinnerType_SC_SPINNER_DOTS: ScSpinnerType = 2;
#[doc = "< `←↖↑↗→↘↓↙` (8 frames, rotating arrow)"]
pub const ScSpinnerType_SC_SPINNER_ARROW: ScSpinnerType = 3;
#[doc = " Animation style of the spinner character."]
pub type ScSpinnerType = ::std::os::raw::c_uint;
#[doc = " Rendering options for a spinner."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScSpinnerOpts {
    #[doc = " Animation frames used for the spinner character."]
    pub type_: ScSpinnerType,
    #[doc = " Color applied to the spinner character; zero-init = no color."]
    pub color: ScColor,
    #[doc = " Style applied to the label text; zero-init = no formatting."]
    pub label_style: ScTextStyle,
    #[doc = " ANSI passthrough for the label; zero-init inherits the\n `sc_set_allow_ansi` global."]
    pub ansi: ScAnsiMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScSpinnerOpts"][::std::mem::size_of::<ScSpinnerOpts>() - 36usize];
    ["Alignment of ScSpinnerOpts"][::std::mem::align_of::<ScSpinnerOpts>() - 4usize];
    ["Offset of field: ScSpinnerOpts::type_"]
        [::std::mem::offset_of!(ScSpinnerOpts, type_) - 0usize];
    ["Offset of field: ScSpinnerOpts::color"]
        [::std::mem::offset_of!(ScSpinnerOpts, color) - 4usize];
    ["Offset of field: ScSpinnerOpts::label_style"]
        [::std::mem::offset_of!(ScSpinnerOpts, label_style) - 12usize];
    ["Offset of field: ScSpinnerOpts::ansi"][::std::mem::offset_of!(ScSpinnerOpts, ansi) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScSpinner {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Allocates a new spinner.\n\n @param label  Initial label printed next to the spinner; may be `NULL`.\n @param opts   Rendering options.\n @return       Heap-allocated spinner; free with `sc_spinner_free`."]
    pub fn sc_spinner_new(
        label: *const ::std::os::raw::c_char,
        opts: ScSpinnerOpts,
    ) -> *mut ScSpinner;
}
extern "C" {
    #[doc = " Sets or replaces the label printed next to the spinner.\n\n @param spinner  Spinner to update.\n @param label    New label; copied internally; `NULL` removes the label."]
    pub fn sc_spinner_set_label(spinner: *mut ScSpinner, label: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Advances to the next animation frame and prints `frame label\\r`.\n\n Pads to the terminal width so a shorter new label cleanly overwrites a\n longer previous one. Always calls `fflush(stdout)`.\n\n @param spinner  Spinner to advance."]
    pub fn sc_spinner_tick(spinner: *mut ScSpinner);
}
extern "C" {
    #[doc = " Clears the spinner line and prints a final status: `✔ label` (green) on\n success, `✖ label` (red) on failure, followed by `\\n`.\n\n @param spinner  Spinner being finished.\n @param success  `true` = print `✔` in green; `false` = print `✖` in red.\n @param label    Optional label printed after the symbol; may be `NULL`."]
    pub fn sc_spinner_finish(
        spinner: *mut ScSpinner,
        success: bool,
        label: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = " Frees `spinner` and the owned label string.\n\n @param spinner  Spinner to free; safe to pass `NULL`."]
    pub fn sc_spinner_free(spinner: *mut ScSpinner);
}
#[doc = " Rendering options for a key-value list."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScKVOpts {
    #[doc = " Separator printed between the padded key and the value; `NULL` = `\"  \"`."]
    pub sep: *const ::std::os::raw::c_char,
    #[doc = " Fixed key column width in columns; `0` = auto-fit to the widest key."]
    pub key_width: ::std::os::raw::c_int,
    #[doc = " Total line width in columns; `0` = terminal width."]
    pub width: ::std::os::raw::c_int,
    #[doc = " Outer margin; top/bottom = blank lines, left/right = outer indent\n in columns."]
    pub margin: ScEdges,
    #[doc = " Blank lines inserted between items; `0` = none."]
    pub item_gap: ::std::os::raw::c_int,
    #[doc = " When `true`, word-wrap long values; when `false`, truncate."]
    pub wrap_val: bool,
    #[doc = " Style applied to keys; zero-init = no formatting."]
    pub key_style: ScTextStyle,
    #[doc = " Style applied to values; zero-init = no formatting."]
    pub val_style: ScTextStyle,
    #[doc = " ANSI passthrough for key/value strings; zero-init inherits the\n `sc_set_allow_ansi` global."]
    pub ansi: ScAnsiMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScKVOpts"][::std::mem::size_of::<ScKVOpts>() - 88usize];
    ["Alignment of ScKVOpts"][::std::mem::align_of::<ScKVOpts>() - 8usize];
    ["Offset of field: ScKVOpts::sep"][::std::mem::offset_of!(ScKVOpts, sep) - 0usize];
    ["Offset of field: ScKVOpts::key_width"][::std::mem::offset_of!(ScKVOpts, key_width) - 8usize];
    ["Offset of field: ScKVOpts::width"][::std::mem::offset_of!(ScKVOpts, width) - 12usize];
    ["Offset of field: ScKVOpts::margin"][::std::mem::offset_of!(ScKVOpts, margin) - 16usize];
    ["Offset of field: ScKVOpts::item_gap"][::std::mem::offset_of!(ScKVOpts, item_gap) - 32usize];
    ["Offset of field: ScKVOpts::wrap_val"][::std::mem::offset_of!(ScKVOpts, wrap_val) - 36usize];
    ["Offset of field: ScKVOpts::key_style"][::std::mem::offset_of!(ScKVOpts, key_style) - 40usize];
    ["Offset of field: ScKVOpts::val_style"][::std::mem::offset_of!(ScKVOpts, val_style) - 60usize];
    ["Offset of field: ScKVOpts::ansi"][::std::mem::offset_of!(ScKVOpts, ansi) - 80usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScKV {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Allocates an empty key-value list.\n\n @param opts  Rendering options.\n @return      Heap-allocated list; free with `sc_kv_free`."]
    pub fn sc_kv_new(opts: ScKVOpts) -> *mut ScKV;
}
extern "C" {
    #[doc = " Appends one key-value pair to `kv`.\n\n @param kv     List the pair is appended to.\n @param key    Key string; copied internally; `NULL` is treated as `\"\"`.\n @param value  Value string; copied internally; `NULL` is treated as `\"\"`."]
    pub fn sc_kv_add(
        kv: *mut ScKV,
        key: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = " Renders `kv` to stdout.\n\n Layout per line: `margin + key (padded to key_w) + sep + value + margin`.\n Continuation lines of a wrapped value are indented to align under the\n value column.\n\n @param kv  List to render; no output when `kv` is `NULL` or empty."]
    pub fn sc_kv_print(kv: *const ScKV);
}
extern "C" {
    #[doc = " Frees `kv`, all its entries and their owned strings.\n\n @param kv  List to free; safe to pass `NULL`."]
    pub fn sc_kv_free(kv: *mut ScKV);
}
#[doc = "< ℹ  Blue    - informational message"]
pub const ScAlertType_SC_ALERT_INFO: ScAlertType = 0;
#[doc = "< ⚙  Magenta - debugging output"]
pub const ScAlertType_SC_ALERT_DEBUG: ScAlertType = 1;
#[doc = "< ⚠  Yellow  - non-fatal warning"]
pub const ScAlertType_SC_ALERT_WARNING: ScAlertType = 2;
#[doc = "< ✖  Red     - error or failure"]
pub const ScAlertType_SC_ALERT_ERROR: ScAlertType = 3;
#[doc = "< ✔  Green   - successful outcome"]
pub const ScAlertType_SC_ALERT_SUCCESS: ScAlertType = 4;
#[doc = " Visual style preset for an alert panel.\n\n Each variant selects a distinct icon, label, and accent color."]
pub type ScAlertType = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Renders a full-width alert panel with a plain-text body.\n\n @param type    Visual preset (icon, label, color).\n @param content Body text; may contain `\\n` for multi-line output."]
    pub fn sc_alert_str(type_: ScAlertType, content: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Renders a full-width alert panel with a rich-text body.\n\n @param type    Visual preset (icon, label, color).\n @param content Rich text body; not freed by this function."]
    pub fn sc_alert_text(type_: ScAlertType, content: *const ScText);
}
extern "C" {
    #[doc = " Renders an info alert (ℹ, blue) with a plain-text body."]
    pub fn sc_alert_info(content: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Renders a debug alert (⚙, magenta) with a plain-text body."]
    pub fn sc_alert_debug(content: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Renders a warning alert (⚠, yellow) with a plain-text body."]
    pub fn sc_alert_warning(content: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Renders an error alert (✖, red) with a plain-text body."]
    pub fn sc_alert_error(content: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Renders a success alert (✔, green) with a plain-text body."]
    pub fn sc_alert_success(content: *const ::std::os::raw::c_char);
}
#[doc = " Rendering options for an inline badge token.\n\n Badge string: `left_cap + pad×' ' + text + pad×' ' + right_cap`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScBadgeOpts {
    #[doc = " Left bracket string; `NULL` = `\"[\"`."]
    pub left_cap: *const ::std::os::raw::c_char,
    #[doc = " Right bracket string; `NULL` = `\"]\"`."]
    pub right_cap: *const ::std::os::raw::c_char,
    #[doc = " Style applied to the full badge (caps, padding and text);\n zero-init = no formatting."]
    pub text_style: ScTextStyle,
    #[doc = " Spaces inserted inside each cap; default `0`."]
    pub pad: ::std::os::raw::c_int,
    #[doc = " ANSI passthrough for the badge text; zero-init inherits the\n `sc_set_allow_ansi` global."]
    pub ansi: ScAnsiMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScBadgeOpts"][::std::mem::size_of::<ScBadgeOpts>() - 48usize];
    ["Alignment of ScBadgeOpts"][::std::mem::align_of::<ScBadgeOpts>() - 8usize];
    ["Offset of field: ScBadgeOpts::left_cap"]
        [::std::mem::offset_of!(ScBadgeOpts, left_cap) - 0usize];
    ["Offset of field: ScBadgeOpts::right_cap"]
        [::std::mem::offset_of!(ScBadgeOpts, right_cap) - 8usize];
    ["Offset of field: ScBadgeOpts::text_style"]
        [::std::mem::offset_of!(ScBadgeOpts, text_style) - 16usize];
    ["Offset of field: ScBadgeOpts::pad"][::std::mem::offset_of!(ScBadgeOpts, pad) - 36usize];
    ["Offset of field: ScBadgeOpts::ansi"][::std::mem::offset_of!(ScBadgeOpts, ansi) - 40usize];
};
extern "C" {
    #[doc = " Prints a styled badge token to stdout (no trailing newline).\n\n @param text  Badge text; may be `NULL` to print just the caps and padding.\n @param opts  Rendering options."]
    pub fn sc_print_badge(text: *const ::std::os::raw::c_char, opts: ScBadgeOpts);
}
extern "C" {
    #[doc = " Appends the composed badge string as a single span to `text_obj`.\n\n The full badge (caps + padding + text) is added as one span with\n `opts.text_style` applied; the original `text_obj` retains ownership of\n its existing spans.\n\n @param text_obj  Rich-text object the badge is appended to.\n @param text      Badge text; may be `NULL`.\n @param opts      Rendering options."]
    pub fn sc_text_append_badge(
        text_obj: *mut ScText,
        text: *const ::std::os::raw::c_char,
        opts: ScBadgeOpts,
    );
}
extern "C" {
    #[doc = " Returns a heap-allocated copy of `str` with all ANSI escape sequences\n removed.\n\n Strips CSI sequences (`ESC [` … final byte `0x40`-`0x7E`), OSC sequences\n (`ESC ]` … `BEL` or `ESC \\`), DCS/SOS/PM/APC string sequences\n (`ESC P/X/^/_` … `ESC \\`), two-character escape sequences (e.g.\n `ESC c`), and lone/malformed `ESC` bytes. All other bytes (including\n control bytes like `\\t`) are copied verbatim.\n\n @param str  Source string; `NULL` returns an empty heap string.\n @return     Heap-allocated stripped string; caller must `free()` the result.\n             Returns `NULL` only on allocation failure."]
    pub fn sc_strip_ansi(str_: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Returns a heap-allocated copy of `str` truncated to `max_cols` visible\n columns, appending `ellipsis` when truncation happens.\n\n If the visible width of `str` already fits within `max_cols`, returns a\n plain `strdup` copy. Otherwise `ellipsis` is appended after as many full\n UTF-8 codepoints of `str` as fit into `max_cols - visible_width(ellipsis)`.\n\n @param str       Source string; `NULL` returns an empty heap string.\n @param max_cols  Maximum visible width of the result, in columns.\n @param ellipsis  Trailing marker; may be `NULL` for no marker.\n @return          Heap-allocated truncated string; caller must `free()` it.\n                  Returns `NULL` only on allocation failure."]
    pub fn sc_truncate(
        str_: *const ::std::os::raw::c_char,
        max_cols: ::std::os::raw::c_int,
        ellipsis: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Overwrites the current terminal line with spaces and returns the cursor\n to column 0, then flushes stdout."]
    pub fn sc_clear_line();
}
extern "C" {
    #[doc = " Captures a plain string as a heap-allocated `ScRendered`.\n\n All `sc_capture_*` functions render the widget into an off-screen\n buffer, split the output on newlines, and return an `ScRendered` whose\n `lines` retain their original ANSI codes. The caller must free the\n result with `sc_rendered_free`.\n\n @param str  Source string; a trailing newline is added when missing.\n @return     Heap-allocated `ScRendered`; free with `sc_rendered_free`."]
    pub fn sc_capture_str(str_: *const ::std::os::raw::c_char) -> *mut ScRendered;
}
extern "C" {
    #[doc = " Captures a rich-text object. See `sc_capture_str`."]
    pub fn sc_capture_text(text: *const ScText) -> *mut ScRendered;
}
extern "C" {
    #[doc = " Captures a table rendering. See `sc_capture_str`."]
    pub fn sc_capture_table(table: *const ScTableData, opts: ScTableOpts) -> *mut ScRendered;
}
extern "C" {
    #[doc = " Captures a list rendering. See `sc_capture_str`."]
    pub fn sc_capture_list(list: *const ScList) -> *mut ScRendered;
}
extern "C" {
    #[doc = " Captures a tree rendering. See `sc_capture_str`."]
    pub fn sc_capture_tree(tree: *const ScTree) -> *mut ScRendered;
}
extern "C" {
    #[doc = " Captures a key-value rendering. See `sc_capture_str`."]
    pub fn sc_capture_kv(kv: *const ScKV) -> *mut ScRendered;
}
extern "C" {
    #[doc = " Captures a columns rendering. See `sc_capture_str`."]
    pub fn sc_capture_columns(columns: *const ScColumns) -> *mut ScRendered;
}
extern "C" {
    #[doc = " Captures a plain-string panel rendering. See `sc_capture_str`."]
    pub fn sc_capture_panel_str(
        content: *const ::std::os::raw::c_char,
        opts: ScPanelOpts,
    ) -> *mut ScRendered;
}
extern "C" {
    #[doc = " Captures a rich-text panel rendering. See `sc_capture_str`."]
    pub fn sc_capture_panel_text(content: *const ScText, opts: ScPanelOpts) -> *mut ScRendered;
}
extern "C" {
    #[doc = " Captures a horizontal rule with a plain-string title."]
    pub fn sc_capture_rule_str(
        title: *const ::std::os::raw::c_char,
        opts: ScRuleOpts,
    ) -> *mut ScRendered;
}
extern "C" {
    #[doc = " Captures a horizontal rule with a rich-text title."]
    pub fn sc_capture_rule_text(title: *const ScText, opts: ScRuleOpts) -> *mut ScRendered;
}
extern "C" {
    #[doc = " Stacks captured renderings vertically into a single `ScRendered`.\n\n Lines from `parts[0]` come first, then `gap` blank lines, then `parts[1]`,\n and so on. The result's `max_column_width` is the widest line across all\n parts. This is the building block for placing two (or more) widgets one\n above the other inside a single `sc_columns_add_rendered` column.\n\n The inputs are **not** consumed: the caller still owns every `parts[i]`\n and must free them (and the returned value) with `sc_rendered_free`.\n\n @param parts  Array of `n` non-NULL `ScRendered` pointers, top to bottom.\n @param n      Number of parts; returns NULL when 0.\n @param gap    Blank lines inserted between adjacent parts (clamped to >= 0).\n @return       Heap-allocated `ScRendered`; free with `sc_rendered_free`."]
    pub fn sc_vstack(
        parts: *const *const ScRendered,
        n: usize,
        gap: ::std::os::raw::c_int,
    ) -> *mut ScRendered;
}
#[doc = " Padding values applied around a captured widget.\n\n `top` and `bottom` are emitted as blank lines; `left` and `right` are\n spaces prepended and appended to every content line. Trailing `right`\n spaces are mostly useful in composed contexts (coloured backgrounds);\n they have no visible effect on a plain terminal."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScPadOpts {
    #[doc = " Blank lines printed before the content."]
    pub top: ::std::os::raw::c_int,
    #[doc = " Spaces appended to each content line."]
    pub right: ::std::os::raw::c_int,
    #[doc = " Blank lines printed after the content."]
    pub bottom: ::std::os::raw::c_int,
    #[doc = " Spaces prepended to each content line."]
    pub left: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScPadOpts"][::std::mem::size_of::<ScPadOpts>() - 16usize];
    ["Alignment of ScPadOpts"][::std::mem::align_of::<ScPadOpts>() - 4usize];
    ["Offset of field: ScPadOpts::top"][::std::mem::offset_of!(ScPadOpts, top) - 0usize];
    ["Offset of field: ScPadOpts::right"][::std::mem::offset_of!(ScPadOpts, right) - 4usize];
    ["Offset of field: ScPadOpts::bottom"][::std::mem::offset_of!(ScPadOpts, bottom) - 8usize];
    ["Offset of field: ScPadOpts::left"][::std::mem::offset_of!(ScPadOpts, left) - 12usize];
};
extern "C" {
    #[doc = " Prints `rendered` with the given padding around each line.\n\n @param rendered  Captured widget; no output when `NULL`.\n @param opts      Padding values; negative values are treated as zero."]
    pub fn sc_pad_print(rendered: *const ScRendered, opts: ScPadOpts);
}
extern "C" {
    #[doc = " Convenience wrapper: captures `str` and prints it with the given padding.\n\n @param str   Plain string to render.\n @param opts  Padding values."]
    pub fn sc_pad_str(str_: *const ::std::os::raw::c_char, opts: ScPadOpts);
}
extern "C" {
    #[doc = " Convenience wrapper: captures `text` and prints it with the given padding.\n\n @param text  Rich-text object to render.\n @param opts  Padding values."]
    pub fn sc_pad_text(text: *const ScText, opts: ScPadOpts);
}
extern "C" {
    #[doc = " Aligns each line of `rendered` within `width` columns and prints them.\n\n `SC_ALIGN_LEFT` is a no-op; lines are emitted as captured. For CENTER\n and RIGHT, the spare columns (`width - line_visible_width`) are added\n as left padding (`spare / 2` for CENTER, `spare` for RIGHT). Trailing\n spaces are not emitted.\n\n @param rendered  Captured widget; no output when `NULL`.\n @param halign     Horizontal alignment (LEFT / CENTER / RIGHT).\n @param width     Target width in columns; `0` = current terminal width."]
    pub fn sc_align_print(
        rendered: *const ScRendered,
        halign: ScHAlign,
        width: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Convenience wrapper: captures `str` and aligns it via `sc_align_print`.\n\n @param str    Plain string to render.\n @param halign  Horizontal alignment.\n @param width  Target width in columns; `0` = current terminal width."]
    pub fn sc_align_str(
        str_: *const ::std::os::raw::c_char,
        halign: ScHAlign,
        width: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Convenience wrapper: captures `text` and aligns it via `sc_align_print`.\n\n @param text   Rich-text object to render.\n @param halign  Horizontal alignment.\n @param width  Target width in columns; `0` = current terminal width."]
    pub fn sc_align_text(text: *const ScText, halign: ScHAlign, width: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = " Returns the `FILE *` sparcli writes its output to.\n\n Defaults to `stdout` when `sc_output_set_stream` has not been called (or the\n caller has reset the output to `NULL`). All sparcli print/render\n functions go through this stream, so redirecting it lets callers\n capture output into a memory buffer, a log file, or a custom stream\n without intercepting `stdout` globally.\n\n @return  Current output stream; never `NULL`."]
    pub fn sc_output_stream() -> *mut FILE;
}
extern "C" {
    #[doc = " Sets the stream sparcli will write its output to.\n\n Pass `NULL` to restore the default (`stdout`). The library does not\n take ownership of `out` - the caller remains responsible for opening,\n flushing and closing it.\n\n @param out  Target stream, or `NULL` to revert to `stdout`.\n\n @note The output target is **thread-local**: each thread has its own, so\n threads may render/capture concurrently to independent streams without\n interfering. A thread that never calls this writes to `stdout`."]
    pub fn sc_output_set_stream(out: *mut FILE);
}
#[doc = "< User confirmed a value (Enter / selection)."]
pub const ScInputStatus_SC_INPUT_OK: ScInputStatus = 0;
#[doc = "< User aborted (Esc or Ctrl-C)."]
pub const ScInputStatus_SC_INPUT_CANCELLED: ScInputStatus = 1;
#[doc = "< Not a TTY, read error, or allocation failure."]
pub const ScInputStatus_SC_INPUT_ERROR: ScInputStatus = 2;
#[doc = " Outcome of an interactive prompt.\n\n Returned by every `sc_*` input widget. A pointer/result is only valid\n when the status is `SC_INPUT_OK`."]
pub type ScInputStatus = ::std::os::raw::c_uint;
#[doc = "< Unset: inherit theme, else inline."]
pub const ScHintLayout_SC_HINT_LAYOUT_DEFAULT: ScHintLayout = 0;
#[doc = "< One `·`-separated line (the default)."]
pub const ScHintLayout_SC_HINT_INLINE: ScHintLayout = 1;
#[doc = "< One hint per line."]
pub const ScHintLayout_SC_HINT_STACKED: ScHintLayout = 2;
#[doc = "< No footer at all."]
pub const ScHintLayout_SC_HINT_HIDDEN: ScHintLayout = 3;
#[doc = " Layout of the dim key-hint footer every widget shows (e.g.\n `↑/↓ move · enter select · esc cancel`).\n\n The zero-init value `SC_HINT_LAYOUT_DEFAULT` means \"unset\": it inherits the\n process-wide theme (`ScInputTheme.hint_layout`) and, if that too is unset,\n resolves to `SC_HINT_INLINE`. This mirrors the `ScWeekStart` sentinel so a\n plain `0` cannot be mistaken for an explicit choice."]
pub type ScHintLayout = ::std::os::raw::c_uint;
#[doc = "< Unset: inherit theme, else bottom."]
pub const ScHintPosition_SC_HINT_POS_DEFAULT: ScHintPosition = 0;
#[doc = "< Above the widget."]
pub const ScHintPosition_SC_HINT_POS_TOP: ScHintPosition = 1;
#[doc = "< Below the widget (the default)."]
pub const ScHintPosition_SC_HINT_POS_BOTTOM: ScHintPosition = 2;
#[doc = "< Left of the widget, top-aligned."]
pub const ScHintPosition_SC_HINT_POS_LEFT: ScHintPosition = 3;
#[doc = "< Right of the widget, top-aligned."]
pub const ScHintPosition_SC_HINT_POS_RIGHT: ScHintPosition = 4;
#[doc = " Placement of the key-hint footer relative to the widget body.\n\n Orthogonal to `ScHintLayout`: any position combines with inline or stacked.\n Left/right place the hint beside the widget, top-aligned. The zero-init\n `SC_HINT_POS_DEFAULT` inherits the theme, then resolves to bottom (the\n historical placement)."]
pub type ScHintPosition = ::std::os::raw::c_uint;
pub const ScKeyType_SC_KEY_NONE: ScKeyType = 0;
#[doc = "< Printable codepoint; see `ScKey.codepoint`/`bytes`."]
pub const ScKeyType_SC_KEY_CHAR: ScKeyType = 1;
pub const ScKeyType_SC_KEY_ENTER: ScKeyType = 2;
pub const ScKeyType_SC_KEY_ESC: ScKeyType = 3;
pub const ScKeyType_SC_KEY_TAB: ScKeyType = 4;
#[doc = "< Shift-Tab."]
pub const ScKeyType_SC_KEY_BACKTAB: ScKeyType = 5;
pub const ScKeyType_SC_KEY_BACKSPACE: ScKeyType = 6;
pub const ScKeyType_SC_KEY_DELETE: ScKeyType = 7;
pub const ScKeyType_SC_KEY_UP: ScKeyType = 8;
pub const ScKeyType_SC_KEY_DOWN: ScKeyType = 9;
pub const ScKeyType_SC_KEY_LEFT: ScKeyType = 10;
pub const ScKeyType_SC_KEY_RIGHT: ScKeyType = 11;
pub const ScKeyType_SC_KEY_HOME: ScKeyType = 12;
pub const ScKeyType_SC_KEY_END: ScKeyType = 13;
pub const ScKeyType_SC_KEY_PAGEUP: ScKeyType = 14;
pub const ScKeyType_SC_KEY_PAGEDOWN: ScKeyType = 15;
#[doc = "< Shift+PageUp."]
pub const ScKeyType_SC_KEY_SHIFT_PAGEUP: ScKeyType = 16;
#[doc = "< Shift+PageDown."]
pub const ScKeyType_SC_KEY_SHIFT_PAGEDOWN: ScKeyType = 17;
pub const ScKeyType_SC_KEY_CTRL_A: ScKeyType = 18;
pub const ScKeyType_SC_KEY_CTRL_C: ScKeyType = 19;
pub const ScKeyType_SC_KEY_CTRL_D: ScKeyType = 20;
pub const ScKeyType_SC_KEY_CTRL_E: ScKeyType = 21;
pub const ScKeyType_SC_KEY_CTRL_K: ScKeyType = 22;
pub const ScKeyType_SC_KEY_CTRL_U: ScKeyType = 23;
pub const ScKeyType_SC_KEY_CTRL_W: ScKeyType = 24;
#[doc = "< Function keys F1-F12 (SS3 or CSI encoded)."]
pub const ScKeyType_SC_KEY_F1: ScKeyType = 25;
pub const ScKeyType_SC_KEY_F2: ScKeyType = 26;
pub const ScKeyType_SC_KEY_F3: ScKeyType = 27;
pub const ScKeyType_SC_KEY_F4: ScKeyType = 28;
pub const ScKeyType_SC_KEY_F5: ScKeyType = 29;
pub const ScKeyType_SC_KEY_F6: ScKeyType = 30;
pub const ScKeyType_SC_KEY_F7: ScKeyType = 31;
pub const ScKeyType_SC_KEY_F8: ScKeyType = 32;
pub const ScKeyType_SC_KEY_F9: ScKeyType = 33;
pub const ScKeyType_SC_KEY_F10: ScKeyType = 34;
pub const ScKeyType_SC_KEY_F11: ScKeyType = 35;
pub const ScKeyType_SC_KEY_F12: ScKeyType = 36;
#[doc = "< Terminal resized (SIGWINCH); repaint and continue."]
pub const ScKeyType_SC_KEY_RESIZE: ScKeyType = 37;
#[doc = " Logical key identity produced by the escape-sequence decoder.\n\n Printable input (including multi-byte UTF-8) is reported as\n `SC_KEY_CHAR`; everything else maps to a named control key."]
pub type ScKeyType = ::std::os::raw::c_uint;
pub const ScKeyMods_SC_MOD_NONE: ScKeyMods = 0;
pub const ScKeyMods_SC_MOD_CTRL: ScKeyMods = 1;
pub const ScKeyMods_SC_MOD_ALT: ScKeyMods = 2;
#[doc = " Modifier bitmask carried by a decoded key (`ScKey.mods`).\n\n `SC_MOD_CTRL` is set on control bytes that are *not* one of the named\n editing keys (so e.g. Ctrl-O arrives as `SC_KEY_CHAR` + `SC_MOD_CTRL`);\n `SC_MOD_ALT` is set when an `ESC` prefix preceded the key (Alt/Meta)."]
pub type ScKeyMods = ::std::os::raw::c_uint;
#[doc = " A single decoded key event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScKey {
    #[doc = " Logical key."]
    pub type_: ScKeyType,
    #[doc = " Unicode codepoint; valid for `SC_KEY_CHAR`."]
    pub codepoint: u32,
    #[doc = " UTF-8 bytes of the char, NUL-terminated."]
    pub bytes: [::std::os::raw::c_char; 8usize],
    #[doc = " Modifier bitmask (`ScKeyMods`); 0 when no modifier applies."]
    pub mods: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScKey"][::std::mem::size_of::<ScKey>() - 20usize];
    ["Alignment of ScKey"][::std::mem::align_of::<ScKey>() - 4usize];
    ["Offset of field: ScKey::type_"][::std::mem::offset_of!(ScKey, type_) - 0usize];
    ["Offset of field: ScKey::codepoint"][::std::mem::offset_of!(ScKey, codepoint) - 4usize];
    ["Offset of field: ScKey::bytes"][::std::mem::offset_of!(ScKey, bytes) - 8usize];
    ["Offset of field: ScKey::mods"][::std::mem::offset_of!(ScKey, mods) - 16usize];
};
extern "C" {
    #[doc = " Decodes a single key event from the front of `buf`.\n\n Pure function with no terminal dependency, so it is unit-testable: feed\n it a byte sequence and inspect the resulting `ScKey`. Handles control\n bytes, CSI/SS3 escape sequences (arrows, Home/End, Delete, PageUp/Down,\n Shift+PageUp/Down, Shift-Tab) and UTF-8 multi-byte characters.\n\n @param buf  Input bytes.\n @param len  Number of valid bytes in `buf`.\n @param out  Receives the decoded key; set to `SC_KEY_NONE` when no key\n             can be decoded.\n @return     Number of bytes consumed. Returns 0 when `len == 0` or when\n             `buf` holds only the prefix of an incomplete sequence (a lone\n             ESC, or a partial UTF-8/CSI sequence) and more bytes are\n             needed; the caller should read more and retry."]
    pub fn sc_key_decode(buf: *const ::std::os::raw::c_char, len: usize, out: *mut ScKey) -> usize;
}
extern "C" {
    #[doc = " Returns `true` when an interactive prompt can run, i.e. a controlling\n terminal is available for both reading and writing.\n\n Widgets call this internally and return `SC_INPUT_ERROR` when it is\n `false` (output redirected to a pipe/file, no TTY in CI, …). Callers can\n use it to decide whether to fall back to a non-interactive default."]
    pub fn sc_input_available() -> bool;
}
#[doc = " A key combination to match against a decoded `ScKey`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScKeyChord {
    #[doc = " `SC_KEY_F1..F12`, a named `SC_KEY_CTRL_*`, or `SC_KEY_CHAR`."]
    pub key: ScKeyType,
    #[doc = " Letter codepoint for `SC_KEY_CHAR` chords (Ctrl/Alt + letter)."]
    pub codepoint: u32,
    #[doc = " Modifier bitmask (`ScKeyMods`)."]
    pub mods: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScKeyChord"][::std::mem::size_of::<ScKeyChord>() - 12usize];
    ["Alignment of ScKeyChord"][::std::mem::align_of::<ScKeyChord>() - 4usize];
    ["Offset of field: ScKeyChord::key"][::std::mem::offset_of!(ScKeyChord, key) - 0usize];
    ["Offset of field: ScKeyChord::codepoint"]
        [::std::mem::offset_of!(ScKeyChord, codepoint) - 4usize];
    ["Offset of field: ScKeyChord::mods"][::std::mem::offset_of!(ScKeyChord, mods) - 8usize];
};
#[doc = "< End the prompt and report the id."]
pub const ScShortcutMode_SC_SHORTCUT_RETURN: ScShortcutMode = 0;
#[doc = "< Run `on_fire`; stay open unless it returns\nfalse."]
pub const ScShortcutMode_SC_SHORTCUT_CALLBACK: ScShortcutMode = 1;
#[doc = " How a fired shortcut affects the running prompt."]
pub type ScShortcutMode = ::std::os::raw::c_uint;
#[doc = " One key binding."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScShortcut {
    #[doc = " Key combination that triggers this shortcut."]
    pub chord: ScKeyChord,
    #[doc = " Caller-defined id reported via `*out_shortcut_id` in RETURN mode\n(>= 0)."]
    pub id: ::std::os::raw::c_int,
    #[doc = " Behavior when fired."]
    pub mode: ScShortcutMode,
    #[doc = " Callback for `SC_SHORTCUT_CALLBACK` mode; receives `id` and `user`.\n Return `true` to keep the prompt open, `false` to close it. Ignored in\n RETURN mode. Runs while the single prompt session is held, so it must\n not start another prompt (that would fail with `SC_INPUT_ERROR`)."]
    pub on_fire: ::std::option::Option<
        unsafe extern "C" fn(id: ::std::os::raw::c_int, user: *mut ::std::os::raw::c_void) -> bool,
    >,
    #[doc = " Opaque pointer passed to `on_fire`."]
    pub user: *mut ::std::os::raw::c_void,
    #[doc = " Optional short label shown in the widget's key-hint footer, e.g.\n `\"delete\"` renders as `^X delete`. `NULL` hides this shortcut from the\n footer (it still fires). The key name is derived from the chord."]
    pub hint_label: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScShortcut"][::std::mem::size_of::<ScShortcut>() - 48usize];
    ["Alignment of ScShortcut"][::std::mem::align_of::<ScShortcut>() - 8usize];
    ["Offset of field: ScShortcut::chord"][::std::mem::offset_of!(ScShortcut, chord) - 0usize];
    ["Offset of field: ScShortcut::id"][::std::mem::offset_of!(ScShortcut, id) - 12usize];
    ["Offset of field: ScShortcut::mode"][::std::mem::offset_of!(ScShortcut, mode) - 16usize];
    ["Offset of field: ScShortcut::on_fire"][::std::mem::offset_of!(ScShortcut, on_fire) - 24usize];
    ["Offset of field: ScShortcut::user"][::std::mem::offset_of!(ScShortcut, user) - 32usize];
    ["Offset of field: ScShortcut::hint_label"]
        [::std::mem::offset_of!(ScShortcut, hint_label) - 40usize];
};
extern "C" {
    #[doc = " Builds a Ctrl-letter chord, e.g. `sc_key_ctrl('e')`.\n\n `letter` is case-insensitive. Ctrl-C (cancel), Ctrl-H (Backspace), Ctrl-I\n (Tab), Ctrl-J/Ctrl-M (Enter) are not bindable - the terminal never delivers\n them as a distinct Ctrl chord - and are rejected by a debug assert."]
    pub fn sc_key_ctrl(letter: ::std::os::raw::c_char) -> ScKeyChord;
}
extern "C" {
    #[doc = " Builds a function-key chord; `n` in `1..12` → F1..F12."]
    pub fn sc_key_fn(n: ::std::os::raw::c_int) -> ScKeyChord;
}
extern "C" {
    #[doc = " Builds an Alt/Meta + letter chord, e.g. `sc_key_alt('e')`."]
    pub fn sc_key_alt(letter: ::std::os::raw::c_char) -> ScKeyChord;
}
extern "C" {
    #[doc = " Returns `true` when `key` matches `chord`. Normalizes the named\n `SC_KEY_CTRL_*` keys against `SC_KEY_CHAR + SC_MOD_CTRL`, so\n `sc_key_ctrl('e')` matches a decoded Ctrl-E however it was encoded."]
    pub fn sc_key_chord_matches(key: ScKey, chord: ScKeyChord) -> bool;
}
extern "C" {
    #[doc = " Returns the first shortcut in `items[0..n)` whose chord matches `key`, or\n `NULL` when none match."]
    pub fn sc_shortcut_find(key: ScKey, items: *const ScShortcut, n: usize) -> *const ScShortcut;
}
extern "C" {
    #[doc = " Writes a short human-readable name for `chord` into `buf` (e.g. `\"F2\"`,\n `\"^E\"`, `\"M-e\"`). Always NUL-terminates when `cap > 0`. Used to build the\n key-hint footer for labeled shortcuts."]
    pub fn sc_key_chord_name(chord: ScKeyChord, buf: *mut ::std::os::raw::c_char, cap: usize);
}
#[doc = " Shared default styling. Any zero-init field falls through to the\nbuilt-in default."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScInputTheme {
    #[doc = " Default highlight color."]
    pub accent: ScColor,
    #[doc = " Default box border (text/password boxed mode)."]
    pub border: ScBorderStyle,
    #[doc = " Default prompt/heading style."]
    pub prompt_style: ScTextStyle,
    #[doc = " Default selected/cursor-row style."]
    pub selected_style: ScTextStyle,
    #[doc = " Default text-cursor cell style."]
    pub cursor_style: ScTextStyle,
    #[doc = " Default counter style."]
    pub count_style: ScTextStyle,
    #[doc = " Default summary-line style."]
    pub summary_style: ScTextStyle,
    #[doc = " Default validation-error style."]
    pub error_style: ScTextStyle,
    #[doc = " Default key-hint footer style."]
    pub hint_style: ScTextStyle,
    #[doc = " Default cursor-row marker."]
    pub cursor_marker: *const ::std::os::raw::c_char,
    #[doc = " Default non-cursor marker."]
    pub marker: *const ::std::os::raw::c_char,
    #[doc = " Default checked box (multi-select)."]
    pub checkbox_on: *const ::std::os::raw::c_char,
    #[doc = " Default unchecked box (multi-select)."]
    pub checkbox_off: *const ::std::os::raw::c_char,
    #[doc = " Default key-hint footer layout (inline / stacked / hidden)."]
    pub hint_layout: ScHintLayout,
    #[doc = " Default key-hint footer placement (top / bottom / left / right)."]
    pub hint_pos: ScHintPosition,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScInputTheme"][::std::mem::size_of::<ScInputTheme>() - 208usize];
    ["Alignment of ScInputTheme"][::std::mem::align_of::<ScInputTheme>() - 8usize];
    ["Offset of field: ScInputTheme::accent"]
        [::std::mem::offset_of!(ScInputTheme, accent) - 0usize];
    ["Offset of field: ScInputTheme::border"]
        [::std::mem::offset_of!(ScInputTheme, border) - 8usize];
    ["Offset of field: ScInputTheme::prompt_style"]
        [::std::mem::offset_of!(ScInputTheme, prompt_style) - 28usize];
    ["Offset of field: ScInputTheme::selected_style"]
        [::std::mem::offset_of!(ScInputTheme, selected_style) - 48usize];
    ["Offset of field: ScInputTheme::cursor_style"]
        [::std::mem::offset_of!(ScInputTheme, cursor_style) - 68usize];
    ["Offset of field: ScInputTheme::count_style"]
        [::std::mem::offset_of!(ScInputTheme, count_style) - 88usize];
    ["Offset of field: ScInputTheme::summary_style"]
        [::std::mem::offset_of!(ScInputTheme, summary_style) - 108usize];
    ["Offset of field: ScInputTheme::error_style"]
        [::std::mem::offset_of!(ScInputTheme, error_style) - 128usize];
    ["Offset of field: ScInputTheme::hint_style"]
        [::std::mem::offset_of!(ScInputTheme, hint_style) - 148usize];
    ["Offset of field: ScInputTheme::cursor_marker"]
        [::std::mem::offset_of!(ScInputTheme, cursor_marker) - 168usize];
    ["Offset of field: ScInputTheme::marker"]
        [::std::mem::offset_of!(ScInputTheme, marker) - 176usize];
    ["Offset of field: ScInputTheme::checkbox_on"]
        [::std::mem::offset_of!(ScInputTheme, checkbox_on) - 184usize];
    ["Offset of field: ScInputTheme::checkbox_off"]
        [::std::mem::offset_of!(ScInputTheme, checkbox_off) - 192usize];
    ["Offset of field: ScInputTheme::hint_layout"]
        [::std::mem::offset_of!(ScInputTheme, hint_layout) - 200usize];
    ["Offset of field: ScInputTheme::hint_pos"]
        [::std::mem::offset_of!(ScInputTheme, hint_pos) - 204usize];
};
extern "C" {
    #[doc = " Installs the process-wide input theme. The struct and its string fields\n (markers, checkbox glyphs) are copied, so the caller's buffers only need\n to live until this call returns. Pass `NULL` to clear it and revert to\n the built-in defaults. Not thread-safe."]
    pub fn sc_input_set_theme(theme: *const ScInputTheme);
}
extern "C" {
    #[doc = " Returns the current theme (a zeroed struct when none is set). The string\nfields point at library-owned copies, valid until the next\n`sc_input_set_theme` call."]
    pub fn sc_input_theme() -> ScInputTheme;
}
#[doc = " Options for `sc_confirm`.\n\n Zero-initialized opts give a sensible prompt: \"No\" preselected, default\n labels, accent in the terminal's default color."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScConfirmOpts {
    #[doc = " Initial selection (`false` = No)."]
    pub default_yes: bool,
    #[doc = " Label for the affirmative; `NULL` = \"Yes\"."]
    pub yes_label: *const ::std::os::raw::c_char,
    #[doc = " Label for the negative; `NULL` = \"No\"."]
    pub no_label: *const ::std::os::raw::c_char,
    #[doc = " Style for the question text."]
    pub prompt_style: ScTextStyle,
    #[doc = " Highlight color of the selected option."]
    pub accent: ScColor,
    #[doc = " Style of the selected option; zero-init = bold black-on-`accent`."]
    pub selected_style: ScTextStyle,
    #[doc = " Style of the unselected option; zero-init = dim."]
    pub unselected_style: ScTextStyle,
    #[doc = " Style of the persistent summary line."]
    pub summary_style: ScTextStyle,
    #[doc = " Suppress the post-confirm summary line."]
    pub hide_summary: bool,
    #[doc = " Key-hint footer; `NULL` = sensible default."]
    pub hint: *const ::std::os::raw::c_char,
    #[doc = " Key-hint footer layout: inline (default) / stacked / hidden."]
    pub hint_layout: ScHintLayout,
    #[doc = " Key-hint footer placement: top / bottom (default) / left / right."]
    pub hint_pos: ScHintPosition,
    #[doc = " Style of the footer; zero-init = dim."]
    pub hint_style: ScTextStyle,
    #[doc = " Custom key shortcuts; borrowed, must outlive the call.\n@see sparcli_shortcut.h"]
    pub shortcuts: *const ScShortcut,
    #[doc = " Number of entries in `shortcuts`."]
    pub n_shortcuts: usize,
    #[doc = " Optional: receives the fired shortcut id (RETURN mode), else `-1`."]
    pub out_shortcut_id: *mut ::std::os::raw::c_int,
    #[doc = " Optional rich question (mixed styles); overrides the string + style.\nBorrowed."]
    pub prompt_text: *const ScText,
    #[doc = " Parse the question string as inline markup, e.g. \"[bold]Delete?[/]\"."]
    pub prompt_markup: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScConfirmOpts"][::std::mem::size_of::<ScConfirmOpts>() - 200usize];
    ["Alignment of ScConfirmOpts"][::std::mem::align_of::<ScConfirmOpts>() - 8usize];
    ["Offset of field: ScConfirmOpts::default_yes"]
        [::std::mem::offset_of!(ScConfirmOpts, default_yes) - 0usize];
    ["Offset of field: ScConfirmOpts::yes_label"]
        [::std::mem::offset_of!(ScConfirmOpts, yes_label) - 8usize];
    ["Offset of field: ScConfirmOpts::no_label"]
        [::std::mem::offset_of!(ScConfirmOpts, no_label) - 16usize];
    ["Offset of field: ScConfirmOpts::prompt_style"]
        [::std::mem::offset_of!(ScConfirmOpts, prompt_style) - 24usize];
    ["Offset of field: ScConfirmOpts::accent"]
        [::std::mem::offset_of!(ScConfirmOpts, accent) - 44usize];
    ["Offset of field: ScConfirmOpts::selected_style"]
        [::std::mem::offset_of!(ScConfirmOpts, selected_style) - 52usize];
    ["Offset of field: ScConfirmOpts::unselected_style"]
        [::std::mem::offset_of!(ScConfirmOpts, unselected_style) - 72usize];
    ["Offset of field: ScConfirmOpts::summary_style"]
        [::std::mem::offset_of!(ScConfirmOpts, summary_style) - 92usize];
    ["Offset of field: ScConfirmOpts::hide_summary"]
        [::std::mem::offset_of!(ScConfirmOpts, hide_summary) - 112usize];
    ["Offset of field: ScConfirmOpts::hint"]
        [::std::mem::offset_of!(ScConfirmOpts, hint) - 120usize];
    ["Offset of field: ScConfirmOpts::hint_layout"]
        [::std::mem::offset_of!(ScConfirmOpts, hint_layout) - 128usize];
    ["Offset of field: ScConfirmOpts::hint_pos"]
        [::std::mem::offset_of!(ScConfirmOpts, hint_pos) - 132usize];
    ["Offset of field: ScConfirmOpts::hint_style"]
        [::std::mem::offset_of!(ScConfirmOpts, hint_style) - 136usize];
    ["Offset of field: ScConfirmOpts::shortcuts"]
        [::std::mem::offset_of!(ScConfirmOpts, shortcuts) - 160usize];
    ["Offset of field: ScConfirmOpts::n_shortcuts"]
        [::std::mem::offset_of!(ScConfirmOpts, n_shortcuts) - 168usize];
    ["Offset of field: ScConfirmOpts::out_shortcut_id"]
        [::std::mem::offset_of!(ScConfirmOpts, out_shortcut_id) - 176usize];
    ["Offset of field: ScConfirmOpts::prompt_text"]
        [::std::mem::offset_of!(ScConfirmOpts, prompt_text) - 184usize];
    ["Offset of field: ScConfirmOpts::prompt_markup"]
        [::std::mem::offset_of!(ScConfirmOpts, prompt_markup) - 192usize];
};
extern "C" {
    #[doc = " Prompts the user with a Yes/No question.\n\n Arrow keys / Tab / `h` / `l` move the selection; `y`/`n` pick directly;\n Enter confirms; Esc or Ctrl-C cancels.\n\n @param question  Prompt text. Must not be `NULL`.\n @param out       Receives the choice on `SC_INPUT_OK`; untouched otherwise.\n @param opts      Rendering options.\n @return          `SC_INPUT_OK`, `SC_INPUT_CANCELLED`, or `SC_INPUT_ERROR`."]
    pub fn sc_confirm(
        question: *const ::std::os::raw::c_char,
        out: *mut bool,
        opts: ScConfirmOpts,
    ) -> ScInputStatus;
}
#[doc = " Validation callback. Return `true` when `value` is acceptable; otherwise\n return `false` and optionally set `*err_out` to a static/owned message\n that the widget displays beneath the field (the prompt stays open)."]
pub type ScValidateFn = ::std::option::Option<
    unsafe extern "C" fn(
        value: *const ::std::os::raw::c_char,
        ctx: *mut ::std::os::raw::c_void,
        err_out: *mut *const ::std::os::raw::c_char,
    ) -> bool,
>;
#[doc = " Per-character input filter. Return `true` to accept the typed codepoint,\n `false` to reject it (the keystroke is ignored). Use it to constrain input\n to a format - digits only, no spaces, etc. Built-in filters below."]
pub type ScCharFilter = ::std::option::Option<
    unsafe extern "C" fn(codepoint: u32, ctx: *mut ::std::os::raw::c_void) -> bool,
>;
extern "C" {
    #[doc = " Accepts ASCII digits `0`-`9` only."]
    pub fn sc_filter_digits(codepoint: u32, ctx: *mut ::std::os::raw::c_void) -> bool;
}
extern "C" {
    #[doc = " Accepts digits, a leading sign and a decimal separator (`0-9`, `-`, `+`,\n`.`, `,`)."]
    pub fn sc_filter_decimal(codepoint: u32, ctx: *mut ::std::os::raw::c_void) -> bool;
}
extern "C" {
    #[doc = " Accepts ASCII letters only."]
    pub fn sc_filter_alpha(codepoint: u32, ctx: *mut ::std::os::raw::c_void) -> bool;
}
extern "C" {
    #[doc = " Accepts ASCII letters and digits only."]
    pub fn sc_filter_alnum(codepoint: u32, ctx: *mut ::std::os::raw::c_void) -> bool;
}
extern "C" {
    #[doc = " Rejects whitespace; accepts everything else."]
    pub fn sc_filter_no_space(codepoint: u32, ctx: *mut ::std::os::raw::c_void) -> bool;
}
#[doc = " Options for `sc_text_input`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScTextInputOpts {
    #[doc = " Pre-filled value; `NULL` = empty."]
    pub initial: *const ::std::os::raw::c_char,
    #[doc = " Dim hint shown while empty; may be `NULL`."]
    pub placeholder: *const ::std::os::raw::c_char,
    #[doc = " Style for the prompt label."]
    pub prompt_style: ScTextStyle,
    #[doc = " Style for the entered value."]
    pub value_style: ScTextStyle,
    #[doc = " Style of the cursor cell; zero-init = black-on-white."]
    pub cursor_style: ScTextStyle,
    #[doc = " Style of the validation error line; zero-init = red."]
    pub error_style: ScTextStyle,
    #[doc = " Style of the persistent summary line."]
    pub summary_style: ScTextStyle,
    #[doc = " Suppress the post-entry summary line."]
    pub hide_summary: bool,
    #[doc = " Max characters; `0` = unlimited. When `> 0` the input is capped and the\n counter shows `count/max`."]
    pub max_chars: ::std::os::raw::c_int,
    #[doc = " Suppress the character counter (shown by default below the field)."]
    pub hide_char_count: bool,
    #[doc = " Style of the character counter; zero-init = dim."]
    pub count_style: ScTextStyle,
    #[doc = " Render the field inside a bordered panel: prompt as the top title,\n counter on the bottom-right border."]
    pub boxed: bool,
    #[doc = " Box border (boxed mode); zero-init type = rounded."]
    pub border: ScBorderStyle,
    #[doc = " Field width in columns; `0` = terminal width. Long values scroll\n horizontally. In boxed mode this is the panel width."]
    pub width: ::std::os::raw::c_int,
    #[doc = " Key-hint footer; `NULL` = sensible default."]
    pub hint: *const ::std::os::raw::c_char,
    #[doc = " Key-hint footer layout: inline (default) / stacked / hidden."]
    pub hint_layout: ScHintLayout,
    #[doc = " Key-hint footer placement: top / bottom (default) / left / right."]
    pub hint_pos: ScHintPosition,
    #[doc = " Style of the footer; zero-init = dim."]
    pub hint_style: ScTextStyle,
    #[doc = " Optional per-character input filter; may be `NULL`."]
    pub char_filter: ScCharFilter,
    #[doc = " Opaque pointer passed to `char_filter`."]
    pub char_filter_ctx: *mut ::std::os::raw::c_void,
    #[doc = " Autocomplete word list; may be `NULL`. The first case-insensitive prefix\n match is shown as dim ghost text; Tab accepts it."]
    pub suggestions: *const *const ::std::os::raw::c_char,
    #[doc = " Number of entries in `suggestions`."]
    pub n_suggestions: usize,
    #[doc = " Optional validator; may be `NULL`."]
    pub validate: ScValidateFn,
    #[doc = " Opaque pointer passed to `validate`."]
    pub validate_ctx: *mut ::std::os::raw::c_void,
    #[doc = " Custom key shortcuts; borrowed, must outlive the call.\n@see sparcli_shortcut.h"]
    pub shortcuts: *const ScShortcut,
    #[doc = " Number of entries in `shortcuts`."]
    pub n_shortcuts: usize,
    #[doc = " Optional: receives the fired shortcut id (RETURN mode), else `-1`."]
    pub out_shortcut_id: *mut ::std::os::raw::c_int,
    #[doc = " Optional rich prompt (mixed styles); overrides the string prompt.\nBorrowed."]
    pub prompt_text: *const ScText,
    #[doc = " Parse the string prompt as inline markup, e.g.\n\"Rename [italic]x[/] to\"."]
    pub prompt_markup: bool,
    #[doc = " Enable opening the value in an external editor (off by default)."]
    pub external_editor: bool,
    #[doc = " Editor command; `NULL`/empty = $VISUAL → $EDITOR → nvim → vi."]
    pub editor: *const ::std::os::raw::c_char,
    #[doc = " Key that opens the editor; zero-init = Ctrl-G.\n@see sparcli_shortcut.h"]
    pub editor_key: ScKeyChord,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScTextInputOpts"][::std::mem::size_of::<ScTextInputOpts>() - 328usize];
    ["Alignment of ScTextInputOpts"][::std::mem::align_of::<ScTextInputOpts>() - 8usize];
    ["Offset of field: ScTextInputOpts::initial"]
        [::std::mem::offset_of!(ScTextInputOpts, initial) - 0usize];
    ["Offset of field: ScTextInputOpts::placeholder"]
        [::std::mem::offset_of!(ScTextInputOpts, placeholder) - 8usize];
    ["Offset of field: ScTextInputOpts::prompt_style"]
        [::std::mem::offset_of!(ScTextInputOpts, prompt_style) - 16usize];
    ["Offset of field: ScTextInputOpts::value_style"]
        [::std::mem::offset_of!(ScTextInputOpts, value_style) - 36usize];
    ["Offset of field: ScTextInputOpts::cursor_style"]
        [::std::mem::offset_of!(ScTextInputOpts, cursor_style) - 56usize];
    ["Offset of field: ScTextInputOpts::error_style"]
        [::std::mem::offset_of!(ScTextInputOpts, error_style) - 76usize];
    ["Offset of field: ScTextInputOpts::summary_style"]
        [::std::mem::offset_of!(ScTextInputOpts, summary_style) - 96usize];
    ["Offset of field: ScTextInputOpts::hide_summary"]
        [::std::mem::offset_of!(ScTextInputOpts, hide_summary) - 116usize];
    ["Offset of field: ScTextInputOpts::max_chars"]
        [::std::mem::offset_of!(ScTextInputOpts, max_chars) - 120usize];
    ["Offset of field: ScTextInputOpts::hide_char_count"]
        [::std::mem::offset_of!(ScTextInputOpts, hide_char_count) - 124usize];
    ["Offset of field: ScTextInputOpts::count_style"]
        [::std::mem::offset_of!(ScTextInputOpts, count_style) - 128usize];
    ["Offset of field: ScTextInputOpts::boxed"]
        [::std::mem::offset_of!(ScTextInputOpts, boxed) - 148usize];
    ["Offset of field: ScTextInputOpts::border"]
        [::std::mem::offset_of!(ScTextInputOpts, border) - 152usize];
    ["Offset of field: ScTextInputOpts::width"]
        [::std::mem::offset_of!(ScTextInputOpts, width) - 172usize];
    ["Offset of field: ScTextInputOpts::hint"]
        [::std::mem::offset_of!(ScTextInputOpts, hint) - 176usize];
    ["Offset of field: ScTextInputOpts::hint_layout"]
        [::std::mem::offset_of!(ScTextInputOpts, hint_layout) - 184usize];
    ["Offset of field: ScTextInputOpts::hint_pos"]
        [::std::mem::offset_of!(ScTextInputOpts, hint_pos) - 188usize];
    ["Offset of field: ScTextInputOpts::hint_style"]
        [::std::mem::offset_of!(ScTextInputOpts, hint_style) - 192usize];
    ["Offset of field: ScTextInputOpts::char_filter"]
        [::std::mem::offset_of!(ScTextInputOpts, char_filter) - 216usize];
    ["Offset of field: ScTextInputOpts::char_filter_ctx"]
        [::std::mem::offset_of!(ScTextInputOpts, char_filter_ctx) - 224usize];
    ["Offset of field: ScTextInputOpts::suggestions"]
        [::std::mem::offset_of!(ScTextInputOpts, suggestions) - 232usize];
    ["Offset of field: ScTextInputOpts::n_suggestions"]
        [::std::mem::offset_of!(ScTextInputOpts, n_suggestions) - 240usize];
    ["Offset of field: ScTextInputOpts::validate"]
        [::std::mem::offset_of!(ScTextInputOpts, validate) - 248usize];
    ["Offset of field: ScTextInputOpts::validate_ctx"]
        [::std::mem::offset_of!(ScTextInputOpts, validate_ctx) - 256usize];
    ["Offset of field: ScTextInputOpts::shortcuts"]
        [::std::mem::offset_of!(ScTextInputOpts, shortcuts) - 264usize];
    ["Offset of field: ScTextInputOpts::n_shortcuts"]
        [::std::mem::offset_of!(ScTextInputOpts, n_shortcuts) - 272usize];
    ["Offset of field: ScTextInputOpts::out_shortcut_id"]
        [::std::mem::offset_of!(ScTextInputOpts, out_shortcut_id) - 280usize];
    ["Offset of field: ScTextInputOpts::prompt_text"]
        [::std::mem::offset_of!(ScTextInputOpts, prompt_text) - 288usize];
    ["Offset of field: ScTextInputOpts::prompt_markup"]
        [::std::mem::offset_of!(ScTextInputOpts, prompt_markup) - 296usize];
    ["Offset of field: ScTextInputOpts::external_editor"]
        [::std::mem::offset_of!(ScTextInputOpts, external_editor) - 297usize];
    ["Offset of field: ScTextInputOpts::editor"]
        [::std::mem::offset_of!(ScTextInputOpts, editor) - 304usize];
    ["Offset of field: ScTextInputOpts::editor_key"]
        [::std::mem::offset_of!(ScTextInputOpts, editor_key) - 312usize];
};
extern "C" {
    #[doc = " Prompts for a single line of text.\n\n On `SC_INPUT_OK`, `*out` receives a heap-allocated string the caller must\n `free()`. `*out` is not modified on cancel/error.\n\n @param prompt  Label shown before the field. Must not be `NULL`.\n @param out     Receives the entered string (heap; caller frees).\n @param opts    Rendering and validation options."]
    pub fn sc_text_input(
        prompt: *const ::std::os::raw::c_char,
        out: *mut *mut ::std::os::raw::c_char,
        opts: ScTextInputOpts,
    ) -> ScInputStatus;
}
#[doc = " Options for `sc_password_input`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScPasswordOpts {
    #[doc = " Dim hint shown while empty; may be `NULL`."]
    pub placeholder: *const ::std::os::raw::c_char,
    #[doc = " Glyph per character; `NULL` = \"*\". Empty string (\"\") hides the\nlength."]
    pub mask: *const ::std::os::raw::c_char,
    #[doc = " Style for the prompt label."]
    pub prompt_style: ScTextStyle,
    #[doc = " Style of the cursor cell; zero-init = black-on-white."]
    pub cursor_style: ScTextStyle,
    #[doc = " Style of the validation error line; zero-init = red."]
    pub error_style: ScTextStyle,
    #[doc = " Style of the persistent summary line."]
    pub summary_style: ScTextStyle,
    #[doc = " Suppress the post-entry summary line."]
    pub hide_summary: bool,
    #[doc = " Max characters; `0` = unlimited."]
    pub max_chars: ::std::os::raw::c_int,
    #[doc = " Suppress the character counter."]
    pub hide_char_count: bool,
    #[doc = " Style of the character counter; zero-init = dim."]
    pub count_style: ScTextStyle,
    #[doc = " Render the field inside a bordered panel."]
    pub boxed: bool,
    #[doc = " Box border (boxed mode); zero-init type = rounded."]
    pub border: ScBorderStyle,
    #[doc = " Field width; `0` = terminal width (boxed: panel width)."]
    pub width: ::std::os::raw::c_int,
    #[doc = " Key-hint footer; `NULL` = sensible default."]
    pub hint: *const ::std::os::raw::c_char,
    #[doc = " Key-hint footer layout: inline (default) / stacked / hidden."]
    pub hint_layout: ScHintLayout,
    #[doc = " Key-hint footer placement: top / bottom (default) / left / right."]
    pub hint_pos: ScHintPosition,
    #[doc = " Style of the footer; zero-init = dim."]
    pub hint_style: ScTextStyle,
    #[doc = " Optional per-character input filter; may be `NULL`."]
    pub char_filter: ScCharFilter,
    #[doc = " Opaque pointer passed to `char_filter`."]
    pub char_filter_ctx: *mut ::std::os::raw::c_void,
    #[doc = " Optional validator; may be `NULL`."]
    pub validate: ScValidateFn,
    #[doc = " Opaque pointer passed to `validate`."]
    pub validate_ctx: *mut ::std::os::raw::c_void,
    #[doc = " Custom key shortcuts; borrowed, must outlive the call.\n@see sparcli_shortcut.h"]
    pub shortcuts: *const ScShortcut,
    #[doc = " Number of entries in `shortcuts`."]
    pub n_shortcuts: usize,
    #[doc = " Optional: receives the fired shortcut id (RETURN mode), else `-1`."]
    pub out_shortcut_id: *mut ::std::os::raw::c_int,
    #[doc = " Optional rich prompt (mixed styles); overrides the string prompt.\nBorrowed."]
    pub prompt_text: *const ScText,
    #[doc = " Parse the string prompt as inline markup."]
    pub prompt_markup: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScPasswordOpts"][::std::mem::size_of::<ScPasswordOpts>() - 272usize];
    ["Alignment of ScPasswordOpts"][::std::mem::align_of::<ScPasswordOpts>() - 8usize];
    ["Offset of field: ScPasswordOpts::placeholder"]
        [::std::mem::offset_of!(ScPasswordOpts, placeholder) - 0usize];
    ["Offset of field: ScPasswordOpts::mask"]
        [::std::mem::offset_of!(ScPasswordOpts, mask) - 8usize];
    ["Offset of field: ScPasswordOpts::prompt_style"]
        [::std::mem::offset_of!(ScPasswordOpts, prompt_style) - 16usize];
    ["Offset of field: ScPasswordOpts::cursor_style"]
        [::std::mem::offset_of!(ScPasswordOpts, cursor_style) - 36usize];
    ["Offset of field: ScPasswordOpts::error_style"]
        [::std::mem::offset_of!(ScPasswordOpts, error_style) - 56usize];
    ["Offset of field: ScPasswordOpts::summary_style"]
        [::std::mem::offset_of!(ScPasswordOpts, summary_style) - 76usize];
    ["Offset of field: ScPasswordOpts::hide_summary"]
        [::std::mem::offset_of!(ScPasswordOpts, hide_summary) - 96usize];
    ["Offset of field: ScPasswordOpts::max_chars"]
        [::std::mem::offset_of!(ScPasswordOpts, max_chars) - 100usize];
    ["Offset of field: ScPasswordOpts::hide_char_count"]
        [::std::mem::offset_of!(ScPasswordOpts, hide_char_count) - 104usize];
    ["Offset of field: ScPasswordOpts::count_style"]
        [::std::mem::offset_of!(ScPasswordOpts, count_style) - 108usize];
    ["Offset of field: ScPasswordOpts::boxed"]
        [::std::mem::offset_of!(ScPasswordOpts, boxed) - 128usize];
    ["Offset of field: ScPasswordOpts::border"]
        [::std::mem::offset_of!(ScPasswordOpts, border) - 132usize];
    ["Offset of field: ScPasswordOpts::width"]
        [::std::mem::offset_of!(ScPasswordOpts, width) - 152usize];
    ["Offset of field: ScPasswordOpts::hint"]
        [::std::mem::offset_of!(ScPasswordOpts, hint) - 160usize];
    ["Offset of field: ScPasswordOpts::hint_layout"]
        [::std::mem::offset_of!(ScPasswordOpts, hint_layout) - 168usize];
    ["Offset of field: ScPasswordOpts::hint_pos"]
        [::std::mem::offset_of!(ScPasswordOpts, hint_pos) - 172usize];
    ["Offset of field: ScPasswordOpts::hint_style"]
        [::std::mem::offset_of!(ScPasswordOpts, hint_style) - 176usize];
    ["Offset of field: ScPasswordOpts::char_filter"]
        [::std::mem::offset_of!(ScPasswordOpts, char_filter) - 200usize];
    ["Offset of field: ScPasswordOpts::char_filter_ctx"]
        [::std::mem::offset_of!(ScPasswordOpts, char_filter_ctx) - 208usize];
    ["Offset of field: ScPasswordOpts::validate"]
        [::std::mem::offset_of!(ScPasswordOpts, validate) - 216usize];
    ["Offset of field: ScPasswordOpts::validate_ctx"]
        [::std::mem::offset_of!(ScPasswordOpts, validate_ctx) - 224usize];
    ["Offset of field: ScPasswordOpts::shortcuts"]
        [::std::mem::offset_of!(ScPasswordOpts, shortcuts) - 232usize];
    ["Offset of field: ScPasswordOpts::n_shortcuts"]
        [::std::mem::offset_of!(ScPasswordOpts, n_shortcuts) - 240usize];
    ["Offset of field: ScPasswordOpts::out_shortcut_id"]
        [::std::mem::offset_of!(ScPasswordOpts, out_shortcut_id) - 248usize];
    ["Offset of field: ScPasswordOpts::prompt_text"]
        [::std::mem::offset_of!(ScPasswordOpts, prompt_text) - 256usize];
    ["Offset of field: ScPasswordOpts::prompt_markup"]
        [::std::mem::offset_of!(ScPasswordOpts, prompt_markup) - 264usize];
};
extern "C" {
    #[doc = " Prompts for a secret, rendering each character as a mask glyph.\n\n On `SC_INPUT_OK`, `*out` receives a heap-allocated string the caller must\n `free()`.\n\n @param prompt  Label shown before the field. Must not be `NULL`.\n @param out     Receives the entered secret (heap; caller frees).\n @param opts    Rendering and validation options."]
    pub fn sc_password_input(
        prompt: *const ::std::os::raw::c_char,
        out: *mut *mut ::std::os::raw::c_char,
        opts: ScPasswordOpts,
    ) -> ScInputStatus;
}
#[doc = " Options for `sc_number_input`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScNumberOpts {
    #[doc = " Starting value."]
    pub initial: f64,
    #[doc = " Start with an empty field instead of the formatted `initial` value\n(type the number directly, no pre-fill to delete). Enter on an empty\nfield is ignored, so the prompt never submits \"nothing\" as `0`."]
    pub start_empty: bool,
    #[doc = " Lower bound (used when `max > min`)."]
    pub min: f64,
    #[doc = " Upper bound; `max <= min` = unbounded."]
    pub max: f64,
    #[doc = " Up/Down increment; `0` = 1."]
    pub step: f64,
    #[doc = " Fractional digits shown; `0` = integer."]
    pub decimals: ::std::os::raw::c_int,
    #[doc = " Style for the prompt label."]
    pub prompt_style: ScTextStyle,
    #[doc = " Style for the value."]
    pub value_style: ScTextStyle,
    #[doc = " Cursor cell; zero-init = black-on-white."]
    pub cursor_style: ScTextStyle,
    #[doc = " Style of the persistent summary line."]
    pub summary_style: ScTextStyle,
    #[doc = " Suppress the post-entry summary line."]
    pub hide_summary: bool,
    #[doc = " Key-hint footer; `NULL` = sensible default."]
    pub hint: *const ::std::os::raw::c_char,
    #[doc = " Key-hint footer layout: inline (default) / stacked / hidden."]
    pub hint_layout: ScHintLayout,
    #[doc = " Key-hint footer placement: top / bottom (default) / left / right."]
    pub hint_pos: ScHintPosition,
    #[doc = " Style of the footer; zero-init = dim."]
    pub hint_style: ScTextStyle,
    #[doc = " Render inside a panel (prompt = top title, range/footer below)."]
    pub boxed: bool,
    #[doc = " Box border (boxed mode); zero-init type = rounded."]
    pub border: ScBorderStyle,
    #[doc = " Box width; `0` = full terminal width."]
    pub width: ::std::os::raw::c_int,
    #[doc = " Custom key shortcuts; borrowed, must outlive the call.\n@see sparcli_shortcut.h"]
    pub shortcuts: *const ScShortcut,
    #[doc = " Number of entries in `shortcuts`."]
    pub n_shortcuts: usize,
    #[doc = " Optional: receives the fired shortcut id (RETURN mode), else `-1`."]
    pub out_shortcut_id: *mut ::std::os::raw::c_int,
    #[doc = " Optional rich prompt (mixed styles); overrides the string prompt.\nBorrowed."]
    pub prompt_text: *const ScText,
    #[doc = " Parse the string prompt as inline markup."]
    pub prompt_markup: bool,
    #[doc = " Decimal separator for display and input; `0` or `'.'` = period,\n`','` = comma. Both `.` and `,` keystrokes are always accepted and\nshown as the configured separator."]
    pub decimal_sep: ::std::os::raw::c_char,
    #[doc = " Optional: on `SC_INPUT_OK` receives a heap copy of the submitted value\n as text - exact, never round-tripped through `double`. Always uses\n `'.'` as decimal separator (machine-readable, e.g. for arbitrary-\n precision decimal types) and reflects clamping to `[min, max]`.\n Caller frees with `free()`. `NULL` = not requested."]
    pub out_text: *mut *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScNumberOpts"][::std::mem::size_of::<ScNumberOpts>() - 240usize];
    ["Alignment of ScNumberOpts"][::std::mem::align_of::<ScNumberOpts>() - 8usize];
    ["Offset of field: ScNumberOpts::initial"]
        [::std::mem::offset_of!(ScNumberOpts, initial) - 0usize];
    ["Offset of field: ScNumberOpts::start_empty"]
        [::std::mem::offset_of!(ScNumberOpts, start_empty) - 8usize];
    ["Offset of field: ScNumberOpts::min"][::std::mem::offset_of!(ScNumberOpts, min) - 16usize];
    ["Offset of field: ScNumberOpts::max"][::std::mem::offset_of!(ScNumberOpts, max) - 24usize];
    ["Offset of field: ScNumberOpts::step"][::std::mem::offset_of!(ScNumberOpts, step) - 32usize];
    ["Offset of field: ScNumberOpts::decimals"]
        [::std::mem::offset_of!(ScNumberOpts, decimals) - 40usize];
    ["Offset of field: ScNumberOpts::prompt_style"]
        [::std::mem::offset_of!(ScNumberOpts, prompt_style) - 44usize];
    ["Offset of field: ScNumberOpts::value_style"]
        [::std::mem::offset_of!(ScNumberOpts, value_style) - 64usize];
    ["Offset of field: ScNumberOpts::cursor_style"]
        [::std::mem::offset_of!(ScNumberOpts, cursor_style) - 84usize];
    ["Offset of field: ScNumberOpts::summary_style"]
        [::std::mem::offset_of!(ScNumberOpts, summary_style) - 104usize];
    ["Offset of field: ScNumberOpts::hide_summary"]
        [::std::mem::offset_of!(ScNumberOpts, hide_summary) - 124usize];
    ["Offset of field: ScNumberOpts::hint"][::std::mem::offset_of!(ScNumberOpts, hint) - 128usize];
    ["Offset of field: ScNumberOpts::hint_layout"]
        [::std::mem::offset_of!(ScNumberOpts, hint_layout) - 136usize];
    ["Offset of field: ScNumberOpts::hint_pos"]
        [::std::mem::offset_of!(ScNumberOpts, hint_pos) - 140usize];
    ["Offset of field: ScNumberOpts::hint_style"]
        [::std::mem::offset_of!(ScNumberOpts, hint_style) - 144usize];
    ["Offset of field: ScNumberOpts::boxed"]
        [::std::mem::offset_of!(ScNumberOpts, boxed) - 164usize];
    ["Offset of field: ScNumberOpts::border"]
        [::std::mem::offset_of!(ScNumberOpts, border) - 168usize];
    ["Offset of field: ScNumberOpts::width"]
        [::std::mem::offset_of!(ScNumberOpts, width) - 188usize];
    ["Offset of field: ScNumberOpts::shortcuts"]
        [::std::mem::offset_of!(ScNumberOpts, shortcuts) - 192usize];
    ["Offset of field: ScNumberOpts::n_shortcuts"]
        [::std::mem::offset_of!(ScNumberOpts, n_shortcuts) - 200usize];
    ["Offset of field: ScNumberOpts::out_shortcut_id"]
        [::std::mem::offset_of!(ScNumberOpts, out_shortcut_id) - 208usize];
    ["Offset of field: ScNumberOpts::prompt_text"]
        [::std::mem::offset_of!(ScNumberOpts, prompt_text) - 216usize];
    ["Offset of field: ScNumberOpts::prompt_markup"]
        [::std::mem::offset_of!(ScNumberOpts, prompt_markup) - 224usize];
    ["Offset of field: ScNumberOpts::decimal_sep"]
        [::std::mem::offset_of!(ScNumberOpts, decimal_sep) - 225usize];
    ["Offset of field: ScNumberOpts::out_text"]
        [::std::mem::offset_of!(ScNumberOpts, out_text) - 232usize];
};
extern "C" {
    #[doc = " Prompts for a number.\n\n Type digits/sign/decimal separator to edit; Up/Down adjust by `step`;\n Enter submits; Esc or Ctrl-C cancels. Enter on an empty field is ignored\n (clear the field with Ctrl-U, then Enter does nothing until a value is\n typed). On `SC_INPUT_OK`, `*out` receives the parsed value, clamped to\n `[min, max]` when bounded; when `opts.out_text` is set it additionally\n receives the exact value as a heap string (see `ScNumberOpts.out_text`).\n\n @param prompt  Label shown before the field. Must not be `NULL`.\n @param out     Receives the chosen value.\n @param opts    Rendering and range options."]
    pub fn sc_number_input(
        prompt: *const ::std::os::raw::c_char,
        out: *mut f64,
        opts: ScNumberOpts,
    ) -> ScInputStatus;
}
#[doc = " Options for `sc_textarea`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScTextareaOpts {
    #[doc = " Pre-filled multi-line value; `NULL` = empty."]
    pub initial: *const ::std::os::raw::c_char,
    #[doc = " Dim hint shown while empty; may be `NULL`."]
    pub placeholder: *const ::std::os::raw::c_char,
    #[doc = " Style for the prompt heading."]
    pub prompt_style: ScTextStyle,
    #[doc = " Style for the entered text."]
    pub value_style: ScTextStyle,
    #[doc = " Cursor cell; zero-init = black-on-white."]
    pub cursor_style: ScTextStyle,
    #[doc = " Style of the persistent summary line."]
    pub summary_style: ScTextStyle,
    #[doc = " Suppress the post-entry summary line."]
    pub hide_summary: bool,
    #[doc = " Key-hint footer; `NULL` = sensible default."]
    pub hint: *const ::std::os::raw::c_char,
    #[doc = " Key-hint footer layout: inline (default) / stacked / hidden."]
    pub hint_layout: ScHintLayout,
    #[doc = " Key-hint footer placement: top / bottom (default) / left / right."]
    pub hint_pos: ScHintPosition,
    #[doc = " Style of the footer; zero-init = dim."]
    pub hint_style: ScTextStyle,
    #[doc = " Render the editor inside a bordered panel (prompt = top title)."]
    pub boxed: bool,
    #[doc = " Box border (boxed mode); zero-init type = rounded."]
    pub border: ScBorderStyle,
    #[doc = " Box width; `0` = full terminal width."]
    pub width: ::std::os::raw::c_int,
    #[doc = " Custom key shortcuts; borrowed, must outlive the call.\n@see sparcli_shortcut.h"]
    pub shortcuts: *const ScShortcut,
    #[doc = " Number of entries in `shortcuts`."]
    pub n_shortcuts: usize,
    #[doc = " Optional: receives the fired shortcut id (RETURN mode), else `-1`."]
    pub out_shortcut_id: *mut ::std::os::raw::c_int,
    #[doc = " Optional rich prompt (mixed styles); overrides the string prompt.\nBorrowed."]
    pub prompt_text: *const ScText,
    #[doc = " Parse the string prompt as inline markup."]
    pub prompt_markup: bool,
    #[doc = " Enable opening the value in an external editor (off by default)."]
    pub external_editor: bool,
    #[doc = " Editor command; `NULL`/empty = $VISUAL → $EDITOR → nvim → vi."]
    pub editor: *const ::std::os::raw::c_char,
    #[doc = " Key that opens the editor; zero-init = Ctrl-G.\n@see sparcli_shortcut.h"]
    pub editor_key: ScKeyChord,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScTextareaOpts"][::std::mem::size_of::<ScTextareaOpts>() - 232usize];
    ["Alignment of ScTextareaOpts"][::std::mem::align_of::<ScTextareaOpts>() - 8usize];
    ["Offset of field: ScTextareaOpts::initial"]
        [::std::mem::offset_of!(ScTextareaOpts, initial) - 0usize];
    ["Offset of field: ScTextareaOpts::placeholder"]
        [::std::mem::offset_of!(ScTextareaOpts, placeholder) - 8usize];
    ["Offset of field: ScTextareaOpts::prompt_style"]
        [::std::mem::offset_of!(ScTextareaOpts, prompt_style) - 16usize];
    ["Offset of field: ScTextareaOpts::value_style"]
        [::std::mem::offset_of!(ScTextareaOpts, value_style) - 36usize];
    ["Offset of field: ScTextareaOpts::cursor_style"]
        [::std::mem::offset_of!(ScTextareaOpts, cursor_style) - 56usize];
    ["Offset of field: ScTextareaOpts::summary_style"]
        [::std::mem::offset_of!(ScTextareaOpts, summary_style) - 76usize];
    ["Offset of field: ScTextareaOpts::hide_summary"]
        [::std::mem::offset_of!(ScTextareaOpts, hide_summary) - 96usize];
    ["Offset of field: ScTextareaOpts::hint"]
        [::std::mem::offset_of!(ScTextareaOpts, hint) - 104usize];
    ["Offset of field: ScTextareaOpts::hint_layout"]
        [::std::mem::offset_of!(ScTextareaOpts, hint_layout) - 112usize];
    ["Offset of field: ScTextareaOpts::hint_pos"]
        [::std::mem::offset_of!(ScTextareaOpts, hint_pos) - 116usize];
    ["Offset of field: ScTextareaOpts::hint_style"]
        [::std::mem::offset_of!(ScTextareaOpts, hint_style) - 120usize];
    ["Offset of field: ScTextareaOpts::boxed"]
        [::std::mem::offset_of!(ScTextareaOpts, boxed) - 140usize];
    ["Offset of field: ScTextareaOpts::border"]
        [::std::mem::offset_of!(ScTextareaOpts, border) - 144usize];
    ["Offset of field: ScTextareaOpts::width"]
        [::std::mem::offset_of!(ScTextareaOpts, width) - 164usize];
    ["Offset of field: ScTextareaOpts::shortcuts"]
        [::std::mem::offset_of!(ScTextareaOpts, shortcuts) - 168usize];
    ["Offset of field: ScTextareaOpts::n_shortcuts"]
        [::std::mem::offset_of!(ScTextareaOpts, n_shortcuts) - 176usize];
    ["Offset of field: ScTextareaOpts::out_shortcut_id"]
        [::std::mem::offset_of!(ScTextareaOpts, out_shortcut_id) - 184usize];
    ["Offset of field: ScTextareaOpts::prompt_text"]
        [::std::mem::offset_of!(ScTextareaOpts, prompt_text) - 192usize];
    ["Offset of field: ScTextareaOpts::prompt_markup"]
        [::std::mem::offset_of!(ScTextareaOpts, prompt_markup) - 200usize];
    ["Offset of field: ScTextareaOpts::external_editor"]
        [::std::mem::offset_of!(ScTextareaOpts, external_editor) - 201usize];
    ["Offset of field: ScTextareaOpts::editor"]
        [::std::mem::offset_of!(ScTextareaOpts, editor) - 208usize];
    ["Offset of field: ScTextareaOpts::editor_key"]
        [::std::mem::offset_of!(ScTextareaOpts, editor_key) - 216usize];
};
extern "C" {
    #[doc = " Prompts for multi-line text.\n\n On `SC_INPUT_OK`, `*out` receives a heap-allocated string (with embedded\n newlines) the caller must `free()`.\n\n @param prompt  Heading shown above the editor. Must not be `NULL`.\n @param out     Receives the entered text (heap; caller frees).\n @param opts    Rendering options."]
    pub fn sc_textarea(
        prompt: *const ::std::os::raw::c_char,
        out: *mut *mut ::std::os::raw::c_char,
        opts: ScTextareaOpts,
    ) -> ScInputStatus;
}
#[doc = " Options for a selection prompt."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScSelectOpts {
    #[doc = " Heading above the list; may be `NULL`."]
    pub prompt: *const ::std::os::raw::c_char,
    #[doc = " `true` = multi-select with checkboxes."]
    pub multi: bool,
    #[doc = " Max rows shown at once; `0` = 10."]
    pub max_visible: ::std::os::raw::c_int,
    #[doc = " Style for the heading."]
    pub prompt_style: ScTextStyle,
    #[doc = " Highlight color for the cursor row."]
    pub accent: ScColor,
    #[doc = " Style of the cursor row; zero-init = bold in `accent`."]
    pub selected_style: ScTextStyle,
    #[doc = " Prefix for the cursor row; `NULL` = \"‣ \"."]
    pub cursor_marker: *const ::std::os::raw::c_char,
    #[doc = " Prefix for other rows; `NULL` = \"  \"."]
    pub marker: *const ::std::os::raw::c_char,
    #[doc = " Checked box (multi); `NULL` = \"[x] \"."]
    pub checkbox_on: *const ::std::os::raw::c_char,
    #[doc = " Unchecked box (multi); `NULL` = \"[ ] \"."]
    pub checkbox_off: *const ::std::os::raw::c_char,
    #[doc = " Style of the persistent summary line."]
    pub summary_style: ScTextStyle,
    #[doc = " Suppress the post-selection summary line."]
    pub hide_summary: bool,
    #[doc = " Key-hint footer; `NULL` = sensible default."]
    pub hint: *const ::std::os::raw::c_char,
    #[doc = " Key-hint footer layout: inline (default) / stacked / hidden."]
    pub hint_layout: ScHintLayout,
    #[doc = " Key-hint footer placement: top / bottom (default) / left / right."]
    pub hint_pos: ScHintPosition,
    #[doc = " Style of the footer; zero-init = dim."]
    pub hint_style: ScTextStyle,
    #[doc = " Custom key shortcuts; borrowed, must outlive the run.\n@see sparcli_shortcut.h"]
    pub shortcuts: *const ScShortcut,
    #[doc = " Number of entries in `shortcuts`."]
    pub n_shortcuts: usize,
    #[doc = " Optional: receives the fired shortcut id (RETURN mode), else `-1`."]
    pub out_shortcut_id: *mut ::std::os::raw::c_int,
    #[doc = " Optional rich prompt (mixed styles); overrides the string prompt.\nBorrowed."]
    pub prompt_text: *const ScText,
    #[doc = " Parse the string prompt as inline markup."]
    pub prompt_markup: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScSelectOpts"][::std::mem::size_of::<ScSelectOpts>() - 200usize];
    ["Alignment of ScSelectOpts"][::std::mem::align_of::<ScSelectOpts>() - 8usize];
    ["Offset of field: ScSelectOpts::prompt"]
        [::std::mem::offset_of!(ScSelectOpts, prompt) - 0usize];
    ["Offset of field: ScSelectOpts::multi"][::std::mem::offset_of!(ScSelectOpts, multi) - 8usize];
    ["Offset of field: ScSelectOpts::max_visible"]
        [::std::mem::offset_of!(ScSelectOpts, max_visible) - 12usize];
    ["Offset of field: ScSelectOpts::prompt_style"]
        [::std::mem::offset_of!(ScSelectOpts, prompt_style) - 16usize];
    ["Offset of field: ScSelectOpts::accent"]
        [::std::mem::offset_of!(ScSelectOpts, accent) - 36usize];
    ["Offset of field: ScSelectOpts::selected_style"]
        [::std::mem::offset_of!(ScSelectOpts, selected_style) - 44usize];
    ["Offset of field: ScSelectOpts::cursor_marker"]
        [::std::mem::offset_of!(ScSelectOpts, cursor_marker) - 64usize];
    ["Offset of field: ScSelectOpts::marker"]
        [::std::mem::offset_of!(ScSelectOpts, marker) - 72usize];
    ["Offset of field: ScSelectOpts::checkbox_on"]
        [::std::mem::offset_of!(ScSelectOpts, checkbox_on) - 80usize];
    ["Offset of field: ScSelectOpts::checkbox_off"]
        [::std::mem::offset_of!(ScSelectOpts, checkbox_off) - 88usize];
    ["Offset of field: ScSelectOpts::summary_style"]
        [::std::mem::offset_of!(ScSelectOpts, summary_style) - 96usize];
    ["Offset of field: ScSelectOpts::hide_summary"]
        [::std::mem::offset_of!(ScSelectOpts, hide_summary) - 116usize];
    ["Offset of field: ScSelectOpts::hint"][::std::mem::offset_of!(ScSelectOpts, hint) - 120usize];
    ["Offset of field: ScSelectOpts::hint_layout"]
        [::std::mem::offset_of!(ScSelectOpts, hint_layout) - 128usize];
    ["Offset of field: ScSelectOpts::hint_pos"]
        [::std::mem::offset_of!(ScSelectOpts, hint_pos) - 132usize];
    ["Offset of field: ScSelectOpts::hint_style"]
        [::std::mem::offset_of!(ScSelectOpts, hint_style) - 136usize];
    ["Offset of field: ScSelectOpts::shortcuts"]
        [::std::mem::offset_of!(ScSelectOpts, shortcuts) - 160usize];
    ["Offset of field: ScSelectOpts::n_shortcuts"]
        [::std::mem::offset_of!(ScSelectOpts, n_shortcuts) - 168usize];
    ["Offset of field: ScSelectOpts::out_shortcut_id"]
        [::std::mem::offset_of!(ScSelectOpts, out_shortcut_id) - 176usize];
    ["Offset of field: ScSelectOpts::prompt_text"]
        [::std::mem::offset_of!(ScSelectOpts, prompt_text) - 184usize];
    ["Offset of field: ScSelectOpts::prompt_markup"]
        [::std::mem::offset_of!(ScSelectOpts, prompt_markup) - 192usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScSelect {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Allocates a new selection prompt.\n\n @param opts  Configuration. Copied internally, including the string fields\n              (`prompt`, markers, checkbox glyphs, `hint`); only the fields\n              documented as borrowed (`shortcuts`, `prompt_text`) must\n              outlive the prompt.\n @return      Heap-allocated handle; free with `sc_select_free`."]
    pub fn sc_select_new(opts: ScSelectOpts) -> *mut ScSelect;
}
extern "C" {
    #[doc = " Appends a selectable item.\n\n @param select  Target selection.\n @param label   Item label; copied internally."]
    pub fn sc_select_add(select: *mut ScSelect, label: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Pre-positions the cursor on `index` (clamped) before `sc_select_run`, so a\n sensible default is highlighted on first paint. No-op out of range."]
    pub fn sc_select_set_cursor(select: *mut ScSelect, index: usize);
}
extern "C" {
    #[doc = " Pre-checks or unchecks `index` (multi-select) before `sc_select_run`, to seed\n a default set of selected items. No-op out of range."]
    pub fn sc_select_set_checked(select: *mut ScSelect, index: usize, on: bool);
}
extern "C" {
    #[doc = " Runs the interactive selection.\n\n Arrow keys / `j` / `k` move the cursor; for multi-select, Space toggles\n the current item; Enter confirms; Esc or Ctrl-C cancels.\n\n Single-select writes one index. Multi-select writes the checked indices\n in display order. `*count_io` is in/out: on input it is the capacity of\n `indices`; on `SC_INPUT_OK` it is set to the number actually written.\n\n @param select    Selection to run.\n @param indices   Caller-provided buffer receiving chosen item indices.\n @param count_io  In: capacity of `indices`. Out: number written.\n @return          `SC_INPUT_OK`, `SC_INPUT_CANCELLED`, or `SC_INPUT_ERROR`."]
    pub fn sc_select_run(
        select: *mut ScSelect,
        indices: *mut usize,
        count_io: *mut usize,
    ) -> ScInputStatus;
}
extern "C" {
    #[doc = " Returns the index of the currently highlighted item.\n\n Intended for use from a `SC_SHORTCUT_CALLBACK` callback, which receives the\n `ScSelect*` via its `user` pointer and can query the live cursor. Returns 0\n for a `NULL` selection."]
    pub fn sc_select_cursor(select: *const ScSelect) -> usize;
}
extern "C" {
    #[doc = " Returns the current label of the item at `index` (current order), or `NULL`\n when out of range. The pointer is owned by the selection - copy it if you\n need it past the next mutation."]
    pub fn sc_select_label(select: *const ScSelect, index: usize) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Replaces the label of the item at `index` (the new string is copied). No-op\n when `index` is out of range or on allocation failure (the old label is\n kept). Pair with `sc_select_set_cursor` to edit an item between runs, e.g.\n from a RETURN-mode shortcut that opens a text prompt."]
    pub fn sc_select_set_label(
        select: *mut ScSelect,
        index: usize,
        label: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = " Removes the item at `index` (0-based, current order), freeing its label and\n shifting the rest down. Intended for a `SC_SHORTCUT_CALLBACK` to delete the\n highlighted item live; the cursor is clamped and kept in view. No-op when\n `index` is out of range. Removing the last item leaves an empty list (a\n subsequent Enter then selects nothing)."]
    pub fn sc_select_remove(select: *mut ScSelect, index: usize);
}
extern "C" {
    #[doc = " Frees a selection and all owned item labels.\n\n @param select  Selection to free; safe to pass `NULL`."]
    pub fn sc_select_free(select: *mut ScSelect);
}
#[doc = " Options for a fuzzy finder."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScFuzzyOpts {
    #[doc = " Search-field label; `NULL` = \"Search\"."]
    pub prompt: *const ::std::os::raw::c_char,
    #[doc = " Max result rows shown; `0` = 10."]
    pub max_visible: ::std::os::raw::c_int,
    #[doc = " Highlight color for the cursor row."]
    pub accent: ScColor,
    #[doc = " Render results as a table."]
    pub table: bool,
    #[doc = " Column headers (table view)."]
    pub headers: *const *const ::std::os::raw::c_char,
    #[doc = " Number of columns (table view)."]
    pub n_cols: usize,
    #[doc = " Bitmask selecting which columns the query searches (bit `c` = column\n `c`). `0` (the default) searches all columns. Table view only - the list\n view always searches its single label. A row matches when the query\n matches any selected column; its rank uses the best-scoring column."]
    pub search_columns: u64,
    #[doc = " Search label; zero-init = bold in `accent`."]
    pub prompt_style: ScTextStyle,
    #[doc = " Cursor-row style. List view: zero-init = bold in `accent`. Table view:\n applied as the cursor row's text style over the accent background\n (e.g. `.fg = black` for dark text on the highlight); zero-init = the\n terminal default."]
    pub selected_style: ScTextStyle,
    #[doc = " Query cursor cell; zero-init = black-on-white."]
    pub cursor_style: ScTextStyle,
    #[doc = " \"(n/total)\" counter; zero-init = dim."]
    pub counter_style: ScTextStyle,
    #[doc = " List cursor prefix; `NULL` = \"‣ \"."]
    pub cursor_marker: *const ::std::os::raw::c_char,
    #[doc = " Other-row prefix; `NULL` = \"  \"."]
    pub marker: *const ::std::os::raw::c_char,
    #[doc = " Table-view opts (table mode); zero-init = single border + bold header.\n The cursor row is highlighted with `accent` regardless."]
    pub table_opts: ScTableOpts,
    #[doc = " Style of the persistent summary line."]
    pub summary_style: ScTextStyle,
    #[doc = " Suppress the post-pick summary line."]
    pub hide_summary: bool,
    #[doc = " Key-hint footer; `NULL` = default."]
    pub hint: *const ::std::os::raw::c_char,
    #[doc = " Key-hint footer layout: inline (default) / stacked / hidden."]
    pub hint_layout: ScHintLayout,
    #[doc = " Key-hint footer placement: top / bottom (default) / left / right."]
    pub hint_pos: ScHintPosition,
    #[doc = " Style of the footer; zero-init = dim."]
    pub hint_style: ScTextStyle,
    #[doc = " Custom key shortcuts; borrowed, must outlive the run.\n@see sparcli_shortcut.h"]
    pub shortcuts: *const ScShortcut,
    #[doc = " Number of entries in `shortcuts`."]
    pub n_shortcuts: usize,
    #[doc = " Optional: receives the fired shortcut id (RETURN mode), else `-1`."]
    pub out_shortcut_id: *mut ::std::os::raw::c_int,
    #[doc = " Optional rich prompt (mixed styles); overrides the string prompt.\nBorrowed."]
    pub prompt_text: *const ScText,
    #[doc = " Parse the string prompt as inline markup."]
    pub prompt_markup: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScFuzzyOpts"][::std::mem::size_of::<ScFuzzyOpts>() - 472usize];
    ["Alignment of ScFuzzyOpts"][::std::mem::align_of::<ScFuzzyOpts>() - 8usize];
    ["Offset of field: ScFuzzyOpts::prompt"][::std::mem::offset_of!(ScFuzzyOpts, prompt) - 0usize];
    ["Offset of field: ScFuzzyOpts::max_visible"]
        [::std::mem::offset_of!(ScFuzzyOpts, max_visible) - 8usize];
    ["Offset of field: ScFuzzyOpts::accent"][::std::mem::offset_of!(ScFuzzyOpts, accent) - 12usize];
    ["Offset of field: ScFuzzyOpts::table"][::std::mem::offset_of!(ScFuzzyOpts, table) - 20usize];
    ["Offset of field: ScFuzzyOpts::headers"]
        [::std::mem::offset_of!(ScFuzzyOpts, headers) - 24usize];
    ["Offset of field: ScFuzzyOpts::n_cols"][::std::mem::offset_of!(ScFuzzyOpts, n_cols) - 32usize];
    ["Offset of field: ScFuzzyOpts::search_columns"]
        [::std::mem::offset_of!(ScFuzzyOpts, search_columns) - 40usize];
    ["Offset of field: ScFuzzyOpts::prompt_style"]
        [::std::mem::offset_of!(ScFuzzyOpts, prompt_style) - 48usize];
    ["Offset of field: ScFuzzyOpts::selected_style"]
        [::std::mem::offset_of!(ScFuzzyOpts, selected_style) - 68usize];
    ["Offset of field: ScFuzzyOpts::cursor_style"]
        [::std::mem::offset_of!(ScFuzzyOpts, cursor_style) - 88usize];
    ["Offset of field: ScFuzzyOpts::counter_style"]
        [::std::mem::offset_of!(ScFuzzyOpts, counter_style) - 108usize];
    ["Offset of field: ScFuzzyOpts::cursor_marker"]
        [::std::mem::offset_of!(ScFuzzyOpts, cursor_marker) - 128usize];
    ["Offset of field: ScFuzzyOpts::marker"]
        [::std::mem::offset_of!(ScFuzzyOpts, marker) - 136usize];
    ["Offset of field: ScFuzzyOpts::table_opts"]
        [::std::mem::offset_of!(ScFuzzyOpts, table_opts) - 144usize];
    ["Offset of field: ScFuzzyOpts::summary_style"]
        [::std::mem::offset_of!(ScFuzzyOpts, summary_style) - 368usize];
    ["Offset of field: ScFuzzyOpts::hide_summary"]
        [::std::mem::offset_of!(ScFuzzyOpts, hide_summary) - 388usize];
    ["Offset of field: ScFuzzyOpts::hint"][::std::mem::offset_of!(ScFuzzyOpts, hint) - 392usize];
    ["Offset of field: ScFuzzyOpts::hint_layout"]
        [::std::mem::offset_of!(ScFuzzyOpts, hint_layout) - 400usize];
    ["Offset of field: ScFuzzyOpts::hint_pos"]
        [::std::mem::offset_of!(ScFuzzyOpts, hint_pos) - 404usize];
    ["Offset of field: ScFuzzyOpts::hint_style"]
        [::std::mem::offset_of!(ScFuzzyOpts, hint_style) - 408usize];
    ["Offset of field: ScFuzzyOpts::shortcuts"]
        [::std::mem::offset_of!(ScFuzzyOpts, shortcuts) - 432usize];
    ["Offset of field: ScFuzzyOpts::n_shortcuts"]
        [::std::mem::offset_of!(ScFuzzyOpts, n_shortcuts) - 440usize];
    ["Offset of field: ScFuzzyOpts::out_shortcut_id"]
        [::std::mem::offset_of!(ScFuzzyOpts, out_shortcut_id) - 448usize];
    ["Offset of field: ScFuzzyOpts::prompt_text"]
        [::std::mem::offset_of!(ScFuzzyOpts, prompt_text) - 456usize];
    ["Offset of field: ScFuzzyOpts::prompt_markup"]
        [::std::mem::offset_of!(ScFuzzyOpts, prompt_markup) - 464usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScFuzzy {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Computes a fuzzy subsequence match of `pattern` against `str`.\n\n Case-insensitive. Pure function (no terminal dependency), exposed for\n unit testing and reuse. A higher score is a better match; contiguous\n and word-start matches score higher.\n\n @param pattern  Query string (may be empty → always matches, score 0).\n @param str      Candidate string.\n @param score    Optional out-param receiving the match score.\n @return         `true` when every char of `pattern` occurs in order."]
    pub fn sc_fuzzy_match(
        pattern: *const ::std::os::raw::c_char,
        str_: *const ::std::os::raw::c_char,
        score: *mut ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[doc = " Allocates a new fuzzy finder.\n\n @param opts  Configuration. Copied internally, including the string fields\n              (`prompt`, markers, `hint`, `headers`); only the fields\n              documented as borrowed (`shortcuts`, `prompt_text`,\n              `table_opts` strings) must outlive the finder.\n @return      Heap-allocated handle; free with `sc_fuzzy_free`."]
    pub fn sc_fuzzy_new(opts: ScFuzzyOpts) -> *mut ScFuzzy;
}
extern "C" {
    #[doc = " Adds a single-field item (list view, or a one-column table).\n\n @param fuzzy  Target finder.\n @param label  Item text used for both matching and display; copied."]
    pub fn sc_fuzzy_add(fuzzy: *mut ScFuzzy, label: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Adds a multi-field row (table view). `fields[0]` is used for matching.\n\n @param fuzzy   Target finder.\n @param fields  Array of `n` column strings; copied internally.\n @param n       Number of fields."]
    pub fn sc_fuzzy_add_row(
        fuzzy: *mut ScFuzzy,
        fields: *const *const ::std::os::raw::c_char,
        n: usize,
    );
}
extern "C" {
    #[doc = " Runs the interactive finder.\n\n Typing edits the query; arrow keys / Ctrl-N / Ctrl-P move the cursor;\n Enter selects the highlighted row; Esc or Ctrl-C cancels.\n\n @param fuzzy      Finder to run.\n @param out_index  Receives the chosen item's original add-order index.\n @return           `SC_INPUT_OK`, `SC_INPUT_CANCELLED`, or `SC_INPUT_ERROR`."]
    pub fn sc_fuzzy_run(fuzzy: *mut ScFuzzy, out_index: *mut usize) -> ScInputStatus;
}
extern "C" {
    #[doc = " Returns the original add-order index of the currently highlighted row.\n\n Intended for a `SC_SHORTCUT_CALLBACK` callback, which receives the\n `ScFuzzy*` via its `user` pointer and can query the live selection. Returns\n 0 when there is no current match or `fuzzy` is `NULL`."]
    pub fn sc_fuzzy_cursor_index(fuzzy: *const ScFuzzy) -> usize;
}
extern "C" {
    #[doc = " Removes the row at `index` (0-based, current add order), freeing its fields.\n Intended for a `SC_SHORTCUT_CALLBACK` to delete the highlighted row live:\n pair it with `sc_fuzzy_cursor_index`. The filtered view and cursor are\n rebuilt. No-op when `index` is out of range. Removing the last match leaves\n an empty result set (Enter can no longer submit; Esc cancels)."]
    pub fn sc_fuzzy_remove(fuzzy: *mut ScFuzzy, index: usize);
}
extern "C" {
    #[doc = " Frees a finder and all owned rows.\n\n @param fuzzy  Finder to free; safe to pass `NULL`."]
    pub fn sc_fuzzy_free(fuzzy: *mut ScFuzzy);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::std::mem::size_of::<tm>() - 56usize];
    ["Alignment of tm"][::std::mem::align_of::<tm>() - 8usize];
    ["Offset of field: tm::tm_sec"][::std::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::std::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::std::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::std::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::std::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::std::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::std::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::std::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::std::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::std::mem::offset_of!(tm, tm_gmtoff) - 40usize];
    ["Offset of field: tm::tm_zone"][::std::mem::offset_of!(tm, tm_zone) - 48usize];
};
#[doc = "< Same as Monday."]
pub const ScWeekStart_SC_WEEK_START_DEFAULT: ScWeekStart = 0;
pub const ScWeekStart_SC_WEEK_START_MONDAY: ScWeekStart = 1;
pub const ScWeekStart_SC_WEEK_START_SUNDAY: ScWeekStart = 2;
#[doc = " First column of the week. Zero-init selects the default (Monday); Sunday is\n an explicit value so it stays reachable (a bare `0` cannot mean both \"unset\"\n and \"Sunday\")."]
pub type ScWeekStart = ::std::os::raw::c_uint;
#[doc = " Options for `sc_datepicker`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScDatePickerOpts {
    #[doc = " Heading above the calendar; may be `NULL`."]
    pub prompt: *const ::std::os::raw::c_char,
    #[doc = " First weekday column; zero-init = Monday."]
    pub week_start: ScWeekStart,
    #[doc = " Highlight color for the selected day."]
    pub accent: ScColor,
    #[doc = " Style of the heading; zero-init = bold."]
    pub prompt_style: ScTextStyle,
    #[doc = " Style of the \"Month Year\" line; zero-init = bold in `accent`."]
    pub header_style: ScTextStyle,
    #[doc = " Style of the weekday row; zero-init = dim."]
    pub weekday_style: ScTextStyle,
    #[doc = " Style of the selected day; zero-init = bold black-on-`accent`."]
    pub selected_style: ScTextStyle,
    #[doc = " Glyph left of the month; `NULL` = \"‹\"."]
    pub header_prev: *const ::std::os::raw::c_char,
    #[doc = " Glyph right of the month; `NULL` = \"›\"."]
    pub header_next: *const ::std::os::raw::c_char,
    #[doc = " Style of the persistent summary line."]
    pub summary_style: ScTextStyle,
    #[doc = " Suppress the post-pick summary line."]
    pub hide_summary: bool,
    #[doc = " Key-hint footer; `NULL` = sensible default."]
    pub hint: *const ::std::os::raw::c_char,
    #[doc = " Key-hint footer layout: inline (default) / stacked / hidden."]
    pub hint_layout: ScHintLayout,
    #[doc = " Key-hint footer placement: top / bottom (default) / left / right."]
    pub hint_pos: ScHintPosition,
    #[doc = " Style of the footer; zero-init = dim."]
    pub hint_style: ScTextStyle,
    #[doc = " Custom key shortcuts; borrowed, must outlive the call.\n@see sparcli_shortcut.h"]
    pub shortcuts: *const ScShortcut,
    #[doc = " Number of entries in `shortcuts`."]
    pub n_shortcuts: usize,
    #[doc = " Optional: receives the fired shortcut id (RETURN mode), else `-1`."]
    pub out_shortcut_id: *mut ::std::os::raw::c_int,
    #[doc = " Optional rich prompt (mixed styles); overrides the string prompt.\nBorrowed."]
    pub prompt_text: *const ScText,
    #[doc = " Parse the string prompt as inline markup."]
    pub prompt_markup: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScDatePickerOpts"][::std::mem::size_of::<ScDatePickerOpts>() - 224usize];
    ["Alignment of ScDatePickerOpts"][::std::mem::align_of::<ScDatePickerOpts>() - 8usize];
    ["Offset of field: ScDatePickerOpts::prompt"]
        [::std::mem::offset_of!(ScDatePickerOpts, prompt) - 0usize];
    ["Offset of field: ScDatePickerOpts::week_start"]
        [::std::mem::offset_of!(ScDatePickerOpts, week_start) - 8usize];
    ["Offset of field: ScDatePickerOpts::accent"]
        [::std::mem::offset_of!(ScDatePickerOpts, accent) - 12usize];
    ["Offset of field: ScDatePickerOpts::prompt_style"]
        [::std::mem::offset_of!(ScDatePickerOpts, prompt_style) - 20usize];
    ["Offset of field: ScDatePickerOpts::header_style"]
        [::std::mem::offset_of!(ScDatePickerOpts, header_style) - 40usize];
    ["Offset of field: ScDatePickerOpts::weekday_style"]
        [::std::mem::offset_of!(ScDatePickerOpts, weekday_style) - 60usize];
    ["Offset of field: ScDatePickerOpts::selected_style"]
        [::std::mem::offset_of!(ScDatePickerOpts, selected_style) - 80usize];
    ["Offset of field: ScDatePickerOpts::header_prev"]
        [::std::mem::offset_of!(ScDatePickerOpts, header_prev) - 104usize];
    ["Offset of field: ScDatePickerOpts::header_next"]
        [::std::mem::offset_of!(ScDatePickerOpts, header_next) - 112usize];
    ["Offset of field: ScDatePickerOpts::summary_style"]
        [::std::mem::offset_of!(ScDatePickerOpts, summary_style) - 120usize];
    ["Offset of field: ScDatePickerOpts::hide_summary"]
        [::std::mem::offset_of!(ScDatePickerOpts, hide_summary) - 140usize];
    ["Offset of field: ScDatePickerOpts::hint"]
        [::std::mem::offset_of!(ScDatePickerOpts, hint) - 144usize];
    ["Offset of field: ScDatePickerOpts::hint_layout"]
        [::std::mem::offset_of!(ScDatePickerOpts, hint_layout) - 152usize];
    ["Offset of field: ScDatePickerOpts::hint_pos"]
        [::std::mem::offset_of!(ScDatePickerOpts, hint_pos) - 156usize];
    ["Offset of field: ScDatePickerOpts::hint_style"]
        [::std::mem::offset_of!(ScDatePickerOpts, hint_style) - 160usize];
    ["Offset of field: ScDatePickerOpts::shortcuts"]
        [::std::mem::offset_of!(ScDatePickerOpts, shortcuts) - 184usize];
    ["Offset of field: ScDatePickerOpts::n_shortcuts"]
        [::std::mem::offset_of!(ScDatePickerOpts, n_shortcuts) - 192usize];
    ["Offset of field: ScDatePickerOpts::out_shortcut_id"]
        [::std::mem::offset_of!(ScDatePickerOpts, out_shortcut_id) - 200usize];
    ["Offset of field: ScDatePickerOpts::prompt_text"]
        [::std::mem::offset_of!(ScDatePickerOpts, prompt_text) - 208usize];
    ["Offset of field: ScDatePickerOpts::prompt_markup"]
        [::std::mem::offset_of!(ScDatePickerOpts, prompt_markup) - 216usize];
};
extern "C" {
    #[doc = " Prompts the user to pick a date from a month calendar.\n\n Arrow keys move by day/week; PageUp/PageDown (or `<`/`>`) change month;\n Shift+PageUp/PageDown change year; Enter selects; Esc or Ctrl-C cancels.\n Month/year jumps keep the selected day, clamped to the target month's last\n valid day (e.g. Jan 31 -> Feb 28).\n\n `io` is in/out: its `tm_year`/`tm_mon`/`tm_mday` seed the initial view\n (a zeroed `struct tm` starts at today). On `SC_INPUT_OK` it is overwritten\n with the picked date (normalized via `mktime`).\n\n @param io    In: initial date. Out: picked date. Must not be `NULL`.\n @param opts  Rendering options.\n @return      `SC_INPUT_OK`, `SC_INPUT_CANCELLED`, or `SC_INPUT_ERROR`."]
    pub fn sc_datepicker(io: *mut tm, opts: ScDatePickerOpts) -> ScInputStatus;
}
